{"id": "55953b6c-935d-4386-8666-0ad789bef067", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Carlos, I’m calling about a fall I had at an apartment complex a while back."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you had a fall. That must have been tough. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It happened on November 16, 2020, at Sunrise Suites Hotel in Atlanta. The stairs were really poorly lit, and I didn’t see a step and ended up falling."}, {"speaker": "Intake Specialist", "text": "That sounds painful. Was anyone else around when you fell?"}, {"speaker": "Caller", "text": "No, I was alone at the time."}, {"speaker": "Intake Specialist", "text": "I see. And what kind of injuries did you sustain from the fall?"}, {"speaker": "Caller", "text": "I sprained my ankle and had some deep contusions. They were pretty painful."}, {"speaker": "Intake Specialist", "text": "That sounds really uncomfortable. Did you seek medical treatment for those injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the emergency room right after the fall. They did some X-rays to make sure nothing was broken, and I got some pain medication and a brace for my ankle."}, {"speaker": "Intake Specialist", "text": "I’m glad you got medical attention. Have you had any ongoing issues with your ankle since then, or has it improved?"}, {"speaker": "Caller", "text": "It’s been a while, but I still have some pain occasionally. I don't think it's fully healed."}, {"speaker": "Intake Specialist", "text": "That must be frustrating. Let’s talk a little about the circumstances of the fall. Do you think the property owner, Sunrise Suites Hotel, could be considered liable for your injury?"}, {"speaker": "Caller", "text": "Definitely. The stairs were just way too dark, and I didn’t see a step at all. There should have been better lighting."}, {"speaker": "Intake Specialist", "text": "It sounds like there may be a strong case for liability there. Did you happen to exchange any insurance information with the property owner or their management?"}, {"speaker": "Caller", "text": "No, I didn’t get any insurance information. I just reported it to the front desk, but they didn’t provide any details."}, {"speaker": "Intake Specialist", "text": "I understand. Sometimes it can be challenging to get that information on the spot. Have you looked into whether they have liability insurance for incidents like this?"}, {"speaker": "Caller", "text": "I haven’t. I just assumed they would have something."}, {"speaker": "Intake Specialist", "text": "That’s a reasonable assumption. It’s common for property owners to carry liability insurance, especially in cases like this. Now, just to clarify, have you spoken to or retained another attorney about this matter?"}, {"speaker": "Caller", "text": "No, I haven’t. You’re the first one I’m contacting about it."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that with me. It’s important to have that clear. Given the circumstances and your injuries, it sounds like it might be worth pursuing."}, {"speaker": "Caller", "text": "Yeah, I really think so. I want to make sure they’re held accountable."}, {"speaker": "Intake Specialist", "text": "Absolutely, and that’s completely understandable. Before we move forward, could you tell me if you have any pre-existing injuries that might have affected your recovery?"}, {"speaker": "Caller", "text": "I did have an old ankle injury from a couple of years ago, but this fall made it worse."}, {"speaker": "Intake Specialist", "text": "Thank you for being open about that. It’s important for us to have a full picture of your medical history. I’ll make a note of that."}, {"speaker": "Caller", "text": "Okay, sounds good."}, {"speaker": "Intake Specialist", "text": "Just to summarize what we’ve discussed: You fell on poorly lit stairs at Sunrise Suites Hotel on November 16, 2020, resulting in a sprained ankle and deep contusions. You went to the emergency room for treatment, and while you’ve seen some improvement, you still experience pain. You believe the property owner may be liable due to the poor lighting, but you weren’t able to get their insurance information. You haven’t spoken to another attorney about this yet, and you mentioned a prior ankle injury that has complicated your recovery."}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Great, thank you for confirming. The next step will be for me to pass this information along to one of our attorneys. They will review your case and get back to you regarding the best way to proceed."}, {"speaker": "Caller", "text": "That sounds good. How long will that take?"}, {"speaker": "Intake Specialist", "text": "Generally, our attorneys try to reach out within a few days, but it may vary depending on their current caseload. I assure you they will take a close look at your case."}, {"speaker": "Caller", "text": "Alright, I appreciate that."}, {"speaker": "Intake Specialist", "text": "Of course! One last thing—our firm works on a contingency fee basis, which means you won’t owe us anything unless we successfully recover compensation for you."}, {"speaker": "Caller", "text": "That’s good to know. Thank you!"}, {"speaker": "Intake Specialist", "text": "You’re welcome! If you have any other questions in the meantime, feel free to reach out. Otherwise, we’ll be in touch soon. Take care!"}, {"speaker": "Caller", "text": "Thank you, Carlos. I appreciate your help today."}, {"speaker": "Intake Specialist", "text": "It was my pleasure! Have a great day!"}], "outcome_status": "settled", "outcome_value": 75000}
{"id": "f31cc0fa-31e5-47a0-a9b4-1c4eed288d8a", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Alex, I’m calling about an incident with an e-scooter battery that caught fire while I was charging it."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. That sounds quite alarming. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on July 10, 2022, in Austin, Texas. I plugged in my CookFast Pro 8-quart e-scooter to charge, and suddenly, the battery started smoking and then caught fire."}, {"speaker": "Intake Specialist", "text": "Wow, that must have been a frightening experience! Did you sustain any injuries as a result of the fire?"}, {"speaker": "Caller", "text": "Yes, I did. I ended up with a mild traumatic brain injury. I fell when I tried to move away from the fire."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear about your injury. That sounds very serious. Have you been receiving any medical treatment for your brain injury since the incident?"}, {"speaker": "Caller", "text": "There was some delay in getting treatment. I didn’t realize how serious it was at first."}, {"speaker": "Intake Specialist", "text": "I understand. Sometimes it can take time to fully grasp the severity of an injury. Have you been able to see a doctor or specialist since then?"}, {"speaker": "Caller", "text": "Yes, I eventually saw a neurologist. They did some tests and confirmed the mild traumatic brain injury."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you got evaluated. Now, regarding the e-scooter and the battery, have you had a chance to check if the manufacturer has any insurance or coverage related to this incident?"}, {"speaker": "Caller", "text": "Not really. I haven’t confirmed any coverage details yet. I just assumed they would be responsible."}, {"speaker": "Intake Specialist", "text": "That makes sense, especially since it was a product issue. Did you happen to exchange any information with the manufacturer or retailer about their insurance?"}, {"speaker": "Caller", "text": "No, I didn’t. I was just so shaken up after the incident that I didn’t think to ask."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. How about any witnesses? Were there other people around when the incident occurred who might have seen what happened?"}, {"speaker": "Caller", "text": "Yes, there was a neighbor who saw it happen. They even helped me put out the fire."}, {"speaker": "Intake Specialist", "text": "That’s great to know. Witnesses can be very helpful in these situations. Have you considered whether you’d want to pursue any claims against the manufacturer or retailer of the e-scooter?"}, {"speaker": "Caller", "text": "I definitely want to pursue something. I think they should be held accountable for this."}, {"speaker": "Intake Specialist", "text": "Absolutely, it’s important to hold companies responsible for their products. Just so I have all the facts, have you had any prior legal issues or consulted with another attorney about this case?"}, {"speaker": "Caller", "text": "No, I haven’t had any prior legal issues, and I haven’t spoken with another attorney about this incident."}, {"speaker": "Intake Specialist", "text": "Thank you for clarifying that. It’s important to have a clear picture. Based on what you’ve shared, it sounds like there’s a strong case for liability, given that the battery caught fire while charging. Now, do you have any ongoing expenses related to your medical treatment or any other damages from the incident?"}, {"speaker": "Caller", "text": "Yes, I’ve had some medical bills from the neurologist, and I missed work for a couple of weeks."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. It can be tough dealing with both health and financial concerns. Have you kept track of those medical bills and any lost wages?"}, {"speaker": "Caller", "text": "Yes, I’ve been keeping all my records."}, {"speaker": "Intake Specialist", "text": "That’s excellent. Documentation will be very helpful moving forward. I’ll make sure to pass all this information to one of our attorneys who can review it more closely. They’ll be able to provide guidance on the next steps you can take."}, {"speaker": "Caller", "text": "Thank you, I appreciate that."}, {"speaker": "Intake Specialist", "text": "Of course! Just to summarize our conversation: You experienced an e-scooter battery fire on July 10, 2022, which resulted in a mild traumatic brain injury. You’ve seen a neurologist for treatment, but there was a delay in seeking medical help. You haven’t confirmed any insurance coverage from the manufacturer yet, and you haven’t consulted with another attorney. You’ve also been keeping track of your medical expenses and lost wages."}, {"speaker": "Caller", "text": "Yes, that’s all correct."}, {"speaker": "Intake Specialist", "text": "Great! I’ll pass this information along, and one of our attorneys will be in touch with you shortly to discuss your case further. Do you have any questions for me before we wrap up?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you. We’ll be in touch soon, and I hope you feel better. Take care!"}, {"speaker": "Caller", "text": "Thanks, Alex. Talk soon."}, {"speaker": "Intake Specialist", "text": "Talk soon!"}], "outcome_status": "settled", "outcome_value": 90000}
{"id": "7105249c-b746-4253-b228-fb75984df51b", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I was in a car accident recently, and I need some help."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear that. I’d be happy to help you. Can you tell me a little more about the accident? When did it happen?"}, {"speaker": "Caller", "text": "It was on May 29, 2025."}, {"speaker": "Intake Specialist", "text": "Thank you for that information. And where did the accident take place?"}, {"speaker": "Caller", "text": "It was in Phoenix."}, {"speaker": "Intake Specialist", "text": "Got it. So, can you describe what happened during the accident?"}, {"speaker": "Caller", "text": "I was driving my rideshare SUV when another driver in a pickup truck sideswiped me."}, {"speaker": "Intake Specialist", "text": "That sounds really stressful. Were there any particular circumstances leading up to the sideswipe? For example, were you both moving, or was one of you stopped?"}, {"speaker": "Caller", "text": "We were both moving. I was in the lane next to him, and he just swerved into me."}, {"speaker": "Intake Specialist", "text": "I see. Did you notice if the other driver was behaving erratically or if there were any signs of substance use at the time of the accident?"}, {"speaker": "Caller", "text": "Yes, I think he might have been under the influence. He seemed a bit out of it."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. It’s important to have that context. Now, were you able to exchange insurance information with the other driver?"}, {"speaker": "Caller", "text": "Not really. He didn't have any insurance information on him, and I couldn't get anything."}, {"speaker": "Intake Specialist", "text": "That’s unfortunate. Did you happen to note the name of the rideshare company you were driving for or any other details about the pickup truck driver?"}, {"speaker": "Caller", "text": "I was driving for a well-known rideshare service. But I didn’t catch the pickup truck driver’s name or insurance company."}, {"speaker": "Intake Specialist", "text": "Understood, thanks for clarifying. Now, let’s talk about your injuries. You mentioned you sustained some injuries in the accident. Can you tell me more about that?"}, {"speaker": "Caller", "text": "Yes, I got second-degree burns on my left arm. I think it was from the airbag deploying or something."}, {"speaker": "Intake Specialist", "text": "That sounds painful. Have you received any medical treatment for those burns?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the accident. They treated my burns, but it’s been really uncomfortable since then."}, {"speaker": "Intake Specialist", "text": "I can only imagine. Have you had any follow-up appointments or ongoing treatment for your injuries?"}, {"speaker": "Caller", "text": "I’ve had a couple of follow-up visits, but I’m not sure how much longer I’ll need treatment."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. It sounds like you’ve been through a lot. Now, I want to ask if you’ve spoken to or hired another attorney about this incident?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to anyone else yet."}, {"speaker": "Intake Specialist", "text": "Okay, that’s good to know. So, just to summarize everything we've talked about: the accident occurred on May 29, 2025, in Phoenix, involving your rideshare SUV and a pickup truck that sideswiped you. You mentioned the other driver might have been under the influence, and unfortunately, you weren't able to get any insurance information from him. You suffered second-degree burns on your left arm and have been receiving treatment for that. Is there anything else you think I should know?"}, {"speaker": "Caller", "text": "No, I think that covers it."}, {"speaker": "Intake Specialist", "text": "Great! Thank you for providing all that information. I will pass this along to one of our attorneys who will review it and get back to you. They may have some follow-up questions and will guide you through what steps to take next. Is there a good number for them to reach you at, and is there anything else I can help you with today?"}, {"speaker": "Caller", "text": "Sure, you can reach me at 555-1234. I think that’s all for now, thank you!"}, {"speaker": "Intake Specialist", "text": "Thank you for sharing your contact information. We’ll be in touch soon. Take care, and I hope you feel better soon! Have a great day!"}], "outcome_status": "settled", "outcome_value": 45000}
{"id": "49bdeea9-ed82-400b-9c44-8343ec8e99c3", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Brenda. I’m calling because I had an accident at an apartment complex, and I’m not sure what to do next."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you were in an accident. Let’s talk about what happened so we can figure out how we can help you. Can you tell me a bit more about the incident?"}, {"speaker": "Caller", "text": "Sure. It was on April 7th, 2024. I was at the City of Springfield apartment complex, and I fell down some stairs that were really poorly lit."}, {"speaker": "Intake Specialist", "text": "That sounds painful! Falling down stairs can lead to serious injuries. What injuries did you sustain from the fall?"}, {"speaker": "Caller", "text": "I sprained my ankle, and I have some deep contusions on my legs."}, {"speaker": "Intake Specialist", "text": "Ouch, that sounds very uncomfortable. Have you been able to get medical treatment for your injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the doctor, and they gave me some pain medication and told me to rest my ankle."}, {"speaker": "Intake Specialist", "text": "I’m glad to hear you sought medical help. It’s important for your recovery. Now, regarding the accident itself, can you tell me if there were any specific factors that contributed to your fall besides the poor lighting?"}, {"speaker": "Caller", "text": "Well, the stairs were also kind of uneven, and there were no handrails. I think that made it harder to navigate."}, {"speaker": "Intake Specialist", "text": "That definitely sounds like a safety issue. Do you happen to know if the apartment complex has any liability insurance? Did you exchange any insurance information with the property owner or management?"}, {"speaker": "Caller", "text": "I didn’t get any insurance info from them, but I assume since it’s a major corporation, they should have some coverage."}, {"speaker": "Intake Specialist", "text": "That makes sense. Major corporations typically have insurance to cover these types of incidents. Did you happen to report the accident to anyone at the complex, like management or maintenance?"}, {"speaker": "Caller", "text": "Yes, I told the apartment management about the fall right after it happened. They seemed to take note of it."}, {"speaker": "Intake Specialist", "text": "That’s good to hear. Reporting it is an important step in documenting the incident. Have you spoken with any other attorneys about your case, or are you looking for representation for the first time?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to any other attorneys. This is the first time I’m reaching out for help."}, {"speaker": "Intake Specialist", "text": "Okay, thank you for letting me know. Now, I’d like to ask a few more questions about your experience. How have your injuries affected your daily life so far?"}, {"speaker": "Caller", "text": "It’s been tough. I’ve had to miss some school and can’t do a lot of the things I usually do with my friends."}, {"speaker": "Intake Specialist", "text": "That sounds challenging, especially since you’re a minor and still in school. It’s important to have support during this time. Have you kept track of any medical expenses or other costs related to your injuries?"}, {"speaker": "Caller", "text": "Yes, I have some medical bills from the doctor visits, and my parents have had to help me a lot with getting around."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. It’s good that you’re keeping track of those expenses; they can be important for your case. Before we wrap up, is there anything else you think I should know about the incident or your injuries?"}, {"speaker": "Caller", "text": "I think that covers it. I just hope I can get some help with this."}, {"speaker": "Intake Specialist", "text": "I understand how you feel, and we’re here to help you through this process. Based on everything you’ve shared, I’ll pass your information along to one of our attorneys, who will review your case and contact you to discuss the next steps. We work on a contingency fee basis, which means you won’t have to pay anything unless we win your case."}, {"speaker": "Caller", "text": "That sounds good. Thank you for your help, Brenda."}, {"speaker": "Intake Specialist", "text": "You’re welcome! I’m glad I could assist you today. Just to summarize: you fell down poorly lit stairs at the City of Springfield apartment complex on April 7th, resulting in a sprained ankle and deep contusions. You reported the incident to management, and you haven’t spoken to any other attorneys yet. I’ll make sure our attorney gets in touch with you soon. If you have any questions in the meantime, feel free to call us back. Take care!"}, {"speaker": "Caller", "text": "Thank you, Brenda. I appreciate it!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! Have a great day!"}], "outcome_status": "trial", "outcome_value": 2000000}
{"id": "d5e3a051-4352-4aef-a871-fb6a8c5c5f9b", "transcript": [{"speaker": "Intake Specialist", "text": "Good morning! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I’m calling because I was bitten by a dog a few weeks ago, and I’m looking for some help."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Dog bites can be quite distressing. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It happened on August 24th here in Austin. I was delivering a package to a client, and their German Shepherd came out of nowhere and bit me."}, {"speaker": "Intake Specialist", "text": "That sounds frightening. I hope you're doing okay now. Can you describe the injuries you sustained from the bite?"}, {"speaker": "Caller", "text": "Yes, I sprained my ankle when I tried to back away, and I have some deep contusions on my leg from the bite."}, {"speaker": "Intake Specialist", "text": "That sounds painful. I’m glad you’re reaching out for help. About the incident, do you know if the dog had any history of aggressive behavior?"}, {"speaker": "Caller", "text": "I’m not sure. It was the first time I had gone to that client’s house."}, {"speaker": "Intake Specialist", "text": "Understood. Did you happen to exchange any insurance information with the dog owner after the incident?"}, {"speaker": "Caller", "text": "Yes, they told me they have homeowner's insurance."}, {"speaker": "Intake Specialist", "text": "That’s good to know. It’s important for covering any potential claims. Do you know the name of their insurance company?"}, {"speaker": "Caller", "text": "I think it's State Farm, but I didn’t get any specific details beyond that."}, {"speaker": "Intake Specialist", "text": "That’s helpful information. Now, regarding the injuries, have you sought any medical treatment for your sprained ankle or contusions?"}, {"speaker": "Caller", "text": "Yes, I went to the emergency room right after the incident. They did an X-ray and prescribed some pain medication and physical therapy."}, {"speaker": "Intake Specialist", "text": "I’m glad you got the care you needed. Have you had any follow-up visits or ongoing treatment since then?"}, {"speaker": "Caller", "text": "Yes, I’ve been going to physical therapy twice a week."}, {"speaker": "Intake Specialist", "text": "It sounds like you’re taking the right steps towards recovery. Have you missed any work because of your injuries?"}, {"speaker": "Caller", "text": "Yes, I’ve missed about two weeks of work, and I’m not sure when I’ll be able to return to my normal routine."}, {"speaker": "Intake Specialist", "text": "I can imagine how frustrating that must be. Have you kept any records of your lost wages or medical expenses related to this incident?"}, {"speaker": "Caller", "text": "Yes, I’ve been keeping track of my medical bills and lost wages."}, {"speaker": "Intake Specialist", "text": "That’s great to hear. Documentation can be really helpful. Just to clarify, do you currently have any other attorney representing you for this matter?"}, {"speaker": "Caller", "text": "No, I don’t have anyone else helping me right now."}, {"speaker": "Intake Specialist", "text": "Okay, that’s good to know. As a quick summary, you were bitten by a delivery client’s German Shepherd on August 24th in Austin, Texas. You sustained a sprained ankle and deep contusions, received medical treatment, and are currently undergoing physical therapy. The dog owner has homeowner's insurance with State Farm, and you’ve missed work due to your injuries. Plus, you’re not currently working with any other attorney."}, {"speaker": "Caller", "text": "Yes, that’s right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. I’ll pass this information along to one of our attorneys who will review your case and get back to you. They may have additional questions or insights about your situation."}, {"speaker": "Caller", "text": "Okay, that sounds good. What’s the next step from here?"}, {"speaker": "Intake Specialist", "text": "Once our attorney reviews your information, they’ll reach out to you directly to discuss possible next steps. We work on a contingency fee basis, so you won’t owe anything unless we recover compensation for you."}, {"speaker": "Caller", "text": "That makes sense. Thank you for your help, Diana."}, {"speaker": "Intake Specialist", "text": "You’re welcome! I’m glad I could assist you. If you have any more questions in the meantime, don’t hesitate to reach out. Take care, and I hope you feel better soon!"}, {"speaker": "Caller", "text": "Thank you! I appreciate it."}, {"speaker": "Intake Specialist", "text": "Have a great day!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "802f8224-d78e-4283-b554-73bbf14eeceb", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, I’m calling about a dog bite incident I was involved in."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Yeah, it was on August 9th last year. I was in the hallway of my apartment building in Austin when my neighbor's pit bull attacked me."}, {"speaker": "Intake Specialist", "text": "That sounds really frightening. I hope you’re doing okay now. Can you describe the circumstances of the attack? What led up to it?"}, {"speaker": "Caller", "text": "I was just walking down the hallway when the dog came out of their apartment. It was off-leash, and it just lunged at me. I didn’t see it coming."}, {"speaker": "Intake Specialist", "text": "That must have been terrifying. Did the dog owner come out at all during the incident or after it happened?"}, {"speaker": "Caller", "text": "Yes, they came out right after it happened. They seemed really apologetic and said the dog had never done that before."}, {"speaker": "Intake Specialist", "text": "I see. It sounds like they acknowledged the dog’s behavior. Did you happen to exchange any insurance information with them?"}, {"speaker": "Caller", "text": "Not really. They mentioned they were renting, but I’m not sure if they have renter's insurance or anything like that."}, {"speaker": "Intake Specialist", "text": "That’s understandable. It’s good that you at least know they’re a renter. Can you tell me more about your injuries?"}, {"speaker": "Caller", "text": "I ended up with a sprained ankle and some deep contusions on my leg. It was pretty painful."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear about your injuries. Have you received any medical treatment for those injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the ER right after the incident. They did X-rays and gave me some pain medication. I had to follow up with my doctor a few times as well."}, {"speaker": "Intake Specialist", "text": "It sounds like you’ve been through a lot. Have you kept track of any medical bills or expenses related to your treatment?"}, {"speaker": "Caller", "text": "Yeah, I have all the bills. They add up to quite a bit."}, {"speaker": "Intake Specialist", "text": "Thank you for that information. It's important for us to know the extent of your damages. Have you experienced any other impacts from the injuries, like missing work or any ongoing pain?"}, {"speaker": "Caller", "text": "Yes, I had to take a week off work to recover, and I still have some pain in my ankle, especially when I walk too much."}, {"speaker": "Intake Specialist", "text": "That definitely sounds challenging. I appreciate you sharing that with me. Just to clarify, do you currently have another attorney representing you for this incident?"}, {"speaker": "Caller", "text": "No, I haven’t hired anyone yet."}, {"speaker": "Intake Specialist", "text": "Good to know. I’ll make sure to pass along that you’re not currently represented. So, to summarize, you were attacked by your neighbor's pit bull in the hallway of your apartment on August 9th, 2022. You sustained a sprained ankle and deep contusions, received treatment at the ER, and had follow-up visits. You’re not sure about the dog owner’s insurance since they are renting, and you have not hired another attorney yet."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. The next step will be for me to pass this information along to one of our attorneys, who will review everything and get back to you about how we can assist you further. We work on a contingency fee basis, so you don’t have to worry about upfront fees."}, {"speaker": "Caller", "text": "Okay, that sounds good."}, {"speaker": "Intake Specialist", "text": "Is there anything else you’d like to add or any questions you have for me right now?"}, {"speaker": "Caller", "text": "No, I think I’ve covered everything."}, {"speaker": "Intake Specialist", "text": "Great! Thank you for sharing your story with me today. We’ll be in touch soon. Take care and have a good day!"}, {"speaker": "Caller", "text": "Thank you. You too!"}], "outcome_status": "settled", "outcome_value": 80000}
{"id": "92c1b4cc-fc1e-47f2-a907-c8dfce535171", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about an accident I had recently involving a product."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you were involved in an accident. I’d like to gather some details to understand your situation better. Can you tell me what happened?"}, {"speaker": "Caller", "text": "Sure. It was on July 4th, and I was using a step ladder, the VoltRide X2, when it suddenly collapsed. I fell and hurt my shoulder."}, {"speaker": "Intake Specialist", "text": "That sounds really painful. I hope you’re doing okay. Can you tell me more about the circumstances of the accident? Were you using the ladder for a specific task at the time?"}, {"speaker": "Caller", "text": "Yes, I was just trying to hang some decorations for the holiday. I had used the ladder many times before without any issues."}, {"speaker": "Intake Specialist", "text": "It sounds like you were using it as intended. Can you describe how the ladder collapsed? Were there any visible signs of damage or defects before it fell?"}, {"speaker": "Caller", "text": "No, it looked fine to me. I was on the second step, and it just gave way without any warning. I didn’t notice anything wrong with it."}, {"speaker": "Intake Specialist", "text": "That seems concerning, especially since it was during normal use. You mentioned you hurt your shoulder; can you tell me more about your injuries?"}, {"speaker": "Caller", "text": "Yes, I ended up tearing my rotator cuff. It’s been really painful, and I’ve had to go to physical therapy since then."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you’re going through this. Physical therapy can be a difficult process. Have you been able to obtain any medical records or documentation regarding your injury?"}, {"speaker": "Caller", "text": "Yes, I have some records from my doctor and the physical therapist. They’ve been documenting my progress."}, {"speaker": "Intake Specialist", "text": "That’s great to hear. Having those records can really help in understanding the extent of your injuries. Now, did you happen to exchange any insurance information with the manufacturer of the ladder or the retailer where you purchased it?"}, {"speaker": "Caller", "text": "Not really. I haven’t confirmed any coverage yet. I just assumed they’d have some kind of liability insurance."}, {"speaker": "Intake Specialist", "text": "It sounds like that’s something we might need to look into further. If you don’t have any coverage confirmed, it could complicate things a bit. Have you already spoken to another attorney about this incident?"}, {"speaker": "Caller", "text": "Yes, I reached out to someone else, but I’m not sure if I want to continue with them."}, {"speaker": "Intake Specialist", "text": "I understand. It’s important to feel comfortable with your representation. Can you tell me what made you reach out to us today?"}, {"speaker": "Caller", "text": "I just feel like I need more help. The other attorney hasn’t been very responsive, and I want to make sure I get a fair outcome for my injuries."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. We want to ensure you have the support you need. Since you mentioned significant injuries and a clear liability situation, it sounds like there could be a solid case here. I’ll need to pass this information along to one of our attorneys who can review it in detail."}, {"speaker": "Caller", "text": "That sounds good. What happens next?"}, {"speaker": "Intake Specialist", "text": "After I gather all the details, our attorney will review your case and reach out to you to discuss it further. They’ll look into the specifics of your incident, including the product defect and any potential liability. We work on a contingency fee basis, meaning you won’t owe us anything unless we win your case."}, {"speaker": "Caller", "text": "That’s reassuring. I just want to make sure I’m doing everything I can to get this sorted out."}, {"speaker": "Intake Specialist", "text": "Absolutely. You’re taking the right steps by reaching out. Just to summarize, you were using a VoltRide X2 step ladder on July 4th when it collapsed, resulting in a torn rotator cuff. You’ve been undergoing physical therapy, and you have medical documentation. However, there’s no confirmed insurance coverage from the manufacturer or retailer at this point. Additionally, you have spoken to another attorney but are considering your options."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Great! I’ll make sure to pass all this information along to our attorney. Is there anything else you’d like to share or ask before we conclude our call?"}, {"speaker": "Caller", "text": "No, that covers everything for now. Thank you for your help, Carlos."}, {"speaker": "Intake Specialist", "text": "You’re welcome! I appreciate you taking the time to speak with me today. We’ll be in touch soon with the next steps. Take care and be well!"}], "outcome_status": "settled", "outcome_value": 105000}
{"id": "c15c4240-3985-4bac-83d7-090cd00f7bcc", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda, I’m looking to discuss an incident that happened to me."}, {"speaker": "Intake Specialist", "text": "Of course! I’m here to help. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. I was at the MegaSave Supermarket in Denver on December 12th last year. I spilled some scalding coffee on myself in the lobby."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. It sounds painful. Can you describe what led to the coffee spill? Was there something about the setup in the lobby that contributed to the incident?"}, {"speaker": "Caller", "text": "Well, the coffee was just sitting there in a self-service station. I went to grab a cup, and it was just really hot. I didn’t expect it to be that hot, and when I poured it, it splashed all over my wrist."}, {"speaker": "Intake Specialist", "text": "That sounds really uncomfortable. Did you notice if there were any warnings or signs indicating that the coffee was very hot?"}, {"speaker": "Caller", "text": "No, there weren’t any signs that I saw. I feel like they should have had something to warn customers."}, {"speaker": "Intake Specialist", "text": "I understand. It’s important for businesses to provide a safe environment for their customers. After the spill, did you receive any medical attention?"}, {"speaker": "Caller", "text": "Yes, I had to go to the hospital because my wrist was burned badly. They ended up telling me it was broken, and I’m still dealing with some nerve pain from it."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. It sounds like it’s been a tough recovery for you. Have you been able to get any treatment for the nerve pain?"}, {"speaker": "Caller", "text": "Yes, I’ve been doing physical therapy, but it’s just not getting better. I still have a lot of discomfort."}, {"speaker": "Intake Specialist", "text": "That must be frustrating. I appreciate you sharing all of that with me. Now, regarding the incident, did you happen to exchange any insurance information with the supermarket or find out if they have coverage for incidents like this?"}, {"speaker": "Caller", "text": "I didn’t get any insurance information at the time. I assumed since it’s a major corporation, they would have coverage, but I didn’t ask specifically."}, {"speaker": "Intake Specialist", "text": "That makes sense. It can sometimes be difficult to get that information on the spot. Do you recall if they had any kind of incident report or if you spoke to a manager about what happened?"}, {"speaker": "Caller", "text": "I did talk to a manager afterward, but I didn’t get a copy of any report or anything like that."}, {"speaker": "Intake Specialist", "text": "Thank you for that information. It’s helpful to know you spoke with a manager. Just a couple more questions to help us understand your situation better: do you currently have any other injuries or conditions that may have been pre-existing before this incident?"}, {"speaker": "Caller", "text": "I had some wrist issues from an old sports injury, but nothing that really affected my daily life before this."}, {"speaker": "Intake Specialist", "text": "Got it. Thank you for being honest about that. It’s important for us to have a clear picture. Lastly, do you already have another attorney representing you regarding this incident?"}, {"speaker": "Caller", "text": "No, I don’t have anyone else representing me."}, {"speaker": "Intake Specialist", "text": "Thank you for clarifying that. So, just to summarize what we’ve discussed: you were burned by scalding coffee at the MegaSave Supermarket in Denver on December 12, 2022. You suffered a broken wrist and are experiencing lingering nerve pain, and you didn’t receive any insurance information from the supermarket, but you believe they should have coverage since it’s a major corporation. You also spoke with a manager on-site afterward, and you don’t have another attorney representing you at this time."}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming. I’ll pass all this information along to one of our attorneys, who will review it and get back to you soon. They’ll discuss the possible next steps with you. Is there anything else you’d like to ask me while we’re on the line?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help, Brenda."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I hope you feel better soon, and we’ll be in touch with you shortly. Have a great day!"}], "outcome_status": "trial", "outcome_value": 0}
{"id": "41100b3a-cf7b-44b6-bf89-d4777fb8090a", "transcript": [{"speaker": "Intake Specialist", "text": "Good afternoon! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about a situation I had with an e-scooter."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Yeah, on September 24th, 2022, I was charging my VoltRide X2 e-scooter, and the battery caught fire."}, {"speaker": "Intake Specialist", "text": "Oh wow, that sounds really dangerous! Were you able to get to safety?"}, {"speaker": "Caller", "text": "Yes, thankfully I was. But I ended up injuring my shoulder when I tried to grab the scooter to move it away from anything flammable."}, {"speaker": "Intake Specialist", "text": "I'm glad you were safe. That must have been quite a scare. You mentioned injuring your shoulder—what kind of injury did you sustain?"}, {"speaker": "Caller", "text": "I tore my rotator cuff. It’s been really painful and has affected my daily activities."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear that. Have you received any medical treatment for your injury since the incident?"}, {"speaker": "Caller", "text": "I did, but it was delayed. I didn’t go to the doctor right away because I thought it was just a sprain. But after a few weeks, the pain got worse, and I finally went in."}, {"speaker": "Intake Specialist", "text": "I understand. Delaying medical treatment can sometimes complicate things. Did the doctor confirm the torn rotator cuff during your visit?"}, {"speaker": "Caller", "text": "Yes, they did. I’ve been going through physical therapy now."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you’re getting treatment. How has this injury impacted your daily life or work?"}, {"speaker": "Caller", "text": "It’s made it really difficult to do basic tasks, like lifting things or even just getting dressed. I also work as a warehouse associate, and I’ve had to take time off because I can’t lift boxes."}, {"speaker": "Intake Specialist", "text": "That sounds really challenging. Have you had any discussions with your employer about your time off or any accommodations?"}, {"speaker": "Caller", "text": "Yes, I’ve talked to them about it, but I’m still worried about the medical bills piling up since I had to miss work."}, {"speaker": "Intake Specialist", "text": "I can see how that would be concerning. Let’s talk a bit about the e-scooter itself. Did you happen to exchange any information with the manufacturer or retailer regarding the incident?"}, {"speaker": "Caller", "text": "No, I didn’t. I just reported it to the store where I bought it, but I haven’t heard back."}, {"speaker": "Intake Specialist", "text": "Did you happen to find out if the manufacturer or retailer has any liability insurance for incidents like this?"}, {"speaker": "Caller", "text": "I haven’t been able to find out anything about their insurance coverage."}, {"speaker": "Intake Specialist", "text": "Understood. It can sometimes be difficult to get that information. Since you mentioned the store where you purchased the e-scooter, did you get any contact details from them or the manufacturer?"}, {"speaker": "Caller", "text": "I did get the contact info for the store, but I’m not sure how to reach the manufacturer."}, {"speaker": "Intake Specialist", "text": "That’s a good start. I recommend keeping a record of any communications you have with them. Now, about the incident itself, were there any witnesses or anyone else who saw the fire happen?"}, {"speaker": "Caller", "text": "No, it was just me at home when it happened."}, {"speaker": "Intake Specialist", "text": "Alright. It sounds like you have been through quite a bit. Regarding your injuries, do you have any documentation, like medical records or bills, that could help support your case?"}, {"speaker": "Caller", "text": "Yes, I have some records from my doctor and the physical therapy clinic."}, {"speaker": "Intake Specialist", "text": "That’s great to hear. Having those documents will definitely be helpful. Just to clarify, have you spoken to any other attorneys about this situation, or are you currently working with anyone?"}, {"speaker": "Caller", "text": "No, I haven’t talked to any other attorneys yet."}, {"speaker": "Intake Specialist", "text": "Okay, that’s helpful to know. Now, I want to summarize what we’ve discussed so far to make sure I have all the details correct. You had an incident on September 24th, 2022, where the battery of your VoltRide X2 e-scooter caught fire while charging, resulting in a torn rotator cuff. You’ve received medical treatment, but there was a delay in seeking help. You’re currently undergoing physical therapy, and it has affected your ability to work. You didn’t exchange any insurance information with the manufacturer or retailer, and you haven’t spoken to any other attorneys. Is that correct?"}, {"speaker": "Caller", "text": "Yes, that’s all accurate."}, {"speaker": "Intake Specialist", "text": "Perfect, thank you for confirming that. The next step is that I’ll pass this information along to one of our attorneys who will review your case. They will reach out to you to discuss your situation further and explore your options."}, {"speaker": "Caller", "text": "Sounds good, thank you!"}, {"speaker": "Intake Specialist", "text": "You’re welcome! Just to let you know, we work on a contingency fee basis, which means you won’t owe us anything unless we recover compensation for you. Do you have any other questions or concerns at this time?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thanks again!"}, {"speaker": "Intake Specialist", "text": "You’re welcome! I appreciate you taking the time to speak with me today. We’ll be in touch soon. Take care!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "fb3efb75-33db-4ec0-9972-4e7ed87d9fc0", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Alex. I’m calling about an accident I was in last December."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. I’d like to gather some information to see how we can help you. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on December 11, 2021, in Phoenix. I was riding my motorcycle when a rideshare driver sideswiped me."}, {"speaker": "Intake Specialist", "text": "That sounds really distressing. I hope you’re doing okay now. Can you describe how the accident occurred? Was there anything specific that led to the collision?"}, {"speaker": "Caller", "text": "I was in my lane, and the rideshare SUV just drifted into me. I think they were distracted or something. I didn’t have time to react."}, {"speaker": "Intake Specialist", "text": "That must have been a terrifying experience. Did you happen to get the rideshare driver's information, or any details about their insurance?"}, {"speaker": "Caller", "text": "I didn't get their insurance information right then. I was more concerned about my injuries at the time."}, {"speaker": "Intake Specialist", "text": "I completely understand. It’s important to prioritize your health. What injuries did you sustain in the accident?"}, {"speaker": "Caller", "text": "I ended up with second-degree burns on my left arm. I had to go to the hospital for treatment."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Burns can be quite painful. How has your recovery been since then? Have you had any ongoing treatment or complications?"}, {"speaker": "Caller", "text": "It’s been tough. I’ve had to go through physical therapy, and it still hurts. I can’t really use my arm like I used to."}, {"speaker": "Intake Specialist", "text": "That sounds really challenging. It’s understandable that you’d want to seek help regarding this incident. Have you been able to get in touch with any medical professionals about your injuries?"}, {"speaker": "Caller", "text": "Yes, I’ve been seeing a doctor regularly for the burns and therapy."}, {"speaker": "Intake Specialist", "text": "That’s good to hear you’re getting treatment. Now, regarding the rideshare driver—do you remember if they mentioned their insurance company at all, or if you were able to exchange any details?"}, {"speaker": "Caller", "text": "I didn’t catch any of that. I was just focused on my injuries."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. It’s tough in those moments. Since we don’t have insurance information yet, it might complicate things a bit. Have you considered whether you’d like us to help you find out more about the rideshare driver's coverage?"}, {"speaker": "Caller", "text": "I’m not sure how that works."}, {"speaker": "Intake Specialist", "text": "No problem! Generally, we would look into the rideshare company’s insurance policy, as they usually provide coverage for their drivers while they’re on the job. It might take some time, but we can help you navigate that process. Have you already spoken with another attorney about this?"}, {"speaker": "Caller", "text": "No, I haven’t reached out to anyone else yet."}, {"speaker": "Intake Specialist", "text": "Thanks for letting me know. It’s great that you’re calling us first. Based on what you’ve shared, I want to summarize the information so far: You were involved in a sideswipe accident with a rideshare driver while riding your motorcycle on December 11, 2021, in Phoenix. You’ve sustained second-degree burns on your left arm that required treatment and physical therapy. Unfortunately, we don’t have confirmed insurance coverage details yet, and you haven't spoken with another attorney."}, {"speaker": "Caller", "text": "That’s right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming. I’ll pass this information to one of our attorneys, who will review it and get back to you. They’ll discuss your options and how we can assist you in pursuing your claim. Do you have any questions for me right now?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now."}, {"speaker": "Intake Specialist", "text": "Great! Thank you for reaching out today. We understand how difficult this situation can be. You should expect a call from our attorney soon. If anything else comes to mind or if you have questions later, don’t hesitate to call us back. Take care!"}, {"speaker": "Caller", "text": "Thanks, Alex. I appreciate your help."}, {"speaker": "Intake Specialist", "text": "You’re welcome! Have a good day."}], "outcome_status": "trial", "outcome_value": 4000000}
{"id": "3a6bdd4c-0b2f-4685-838c-1499777ad89d", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Alex. I’d like to talk about a dog bite incident that happened to me."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear that you went through that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on March 12, 2021, at a public park in Seattle. I was just walking when an off-leash German Shepherd ran up to me and bit me."}, {"speaker": "Intake Specialist", "text": "That sounds really painful. I’m glad you’re okay now. Can you describe the injuries you sustained from the bite?"}, {"speaker": "Caller", "text": "Yeah, I had some pretty serious lacerations. I ended up needing 30 stitches."}, {"speaker": "Intake Specialist", "text": "Wow, that’s quite significant. It must have been quite an ordeal for you. Did you seek any medical treatment after the incident?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after it happened."}, {"speaker": "Intake Specialist", "text": "That was a good decision, especially given the severity of your injuries. Were there any witnesses to the incident, or did you happen to get any information from the dog owner?"}, {"speaker": "Caller", "text": "There were a few people around, and I did get the dog owner's contact information, but I didn’t catch their name. They seemed a bit frantic and left pretty quickly after the incident."}, {"speaker": "Intake Specialist", "text": "I understand. That can happen in situations like that. Did you manage to find out if the dog owner had any insurance, or did they mention anything about coverage?"}, {"speaker": "Caller", "text": "They didn’t really talk about insurance, but I think they might have mentioned something about their homeowner's policy."}, {"speaker": "Intake Specialist", "text": "That’s helpful to know. Since it happened in a public park, it’s possible that there could be some involvement from the city as well. Did you report the incident to animal control or the park authorities?"}, {"speaker": "Caller", "text": "No, I didn’t report it. I was just focused on getting medical help."}, {"speaker": "Intake Specialist", "text": "That’s understandable. It’s common to prioritize your health in those moments. Now, regarding your injuries, aside from the stitches, did you experience any ongoing pain or other complications?"}, {"speaker": "Caller", "text": "Yeah, I still have some pain in my arm where I was bitten, and there’s a scar that I don’t think will ever fully heal."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you're still dealing with pain. Scarring can be quite distressing, especially when it’s a visible area. Have you had any time off work due to these injuries?"}, {"speaker": "Caller", "text": "Yes, I had to take about three weeks off to recover."}, {"speaker": "Intake Specialist", "text": "That can be tough financially and emotionally. Have you kept track of any medical expenses related to the incident, such as hospital bills or follow-up treatments?"}, {"speaker": "Caller", "text": "Yes, I have all the medical bills. They’re quite high."}, {"speaker": "Intake Specialist", "text": "It’s good that you’re keeping records of those expenses. They can be important for your case. Just to clarify, have you discussed this incident with any other attorneys or legal representatives?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to anyone else about it."}, {"speaker": "Intake Specialist", "text": "That’s great to know. It sounds like you’re beginning this journey with us. I’d like to ask a few more questions to understand the situation better. Based on what you've shared, would you say the dog owner was responsible for the incident? Do you think they acted negligently by having their dog off-leash in a public area?"}, {"speaker": "Caller", "text": "Definitely. The dog was clearly not under control, and it should have been on a leash."}, {"speaker": "Intake Specialist", "text": "That certainly adds to the case for liability. It seems like there’s a strong argument there. Could you tell me if you've had any prior legal issues or if there’s anything else that might be relevant to your case?"}, {"speaker": "Caller", "text": "I’ve had some minor issues in the past, but nothing serious. I don’t think it’s related to this incident."}, {"speaker": "Intake Specialist", "text": "Thanks for sharing that with me. It’s always good to have a complete picture. Now, just to summarize what we’ve discussed: You were bitten by an off-leash German Shepherd in a public park in Seattle on March 12, 2021. You required 30 stitches, and you’ve got ongoing pain and a scar from the injury. You took three weeks off work and have kept track of the medical expenses. You also have the dog owner's contact information, and they might have homeowner’s insurance."}, {"speaker": "Caller", "text": "That sounds right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming. I will pass this information along to one of our attorneys who will review it and get back to you. They’ll be able to discuss the next steps with you. Do you have any questions for me about the process or anything else?"}, {"speaker": "Caller", "text": "No, I think that covers it for now. Thank you."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I appreciate you sharing your story with me. We’ll be in touch soon, and I hope you start feeling better. Have a great day!"}, {"speaker": "Caller", "text": "Thanks, you too!"}], "outcome_status": "trial", "outcome_value": 0}
{"id": "2ea46121-b7cc-46d2-af4d-13f1bc6f596c", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I’m calling about an accident I had a few days ago."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that! I’d like to gather some details so we can understand your situation better. Can you tell me what happened?"}, {"speaker": "Caller", "text": "Sure. I fell down some stairs at my apartment complex on October 7th. They were poorly lit, and I didn’t see the last step."}, {"speaker": "Intake Specialist", "text": "That sounds really painful. Falling down stairs can be quite serious. Can you tell me a little more about your injuries?"}, {"speaker": "Caller", "text": "Yes, I ended up breaking my wrist, and I’ve been having some lingering nerve pain since then."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you’re dealing with those injuries. It must be frustrating. Have you sought any medical treatment for your wrist or the nerve pain?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the fall, and they put my wrist in a cast. I’ve also been doing some physical therapy for the nerve pain."}, {"speaker": "Intake Specialist", "text": "It’s good to hear you’ve been receiving treatment. Physical therapy can be really beneficial. Now, regarding the incident, do you know if there were any lights near the stairs that were out or any warnings about the condition of the stairs?"}, {"speaker": "Caller", "text": "There weren’t any lights that I could see, and I didn’t notice any signs indicating that the stairs were dangerous."}, {"speaker": "Intake Specialist", "text": "That’s important information. It sounds like there might have been some negligence on the part of the property owner. Speaking of which, do you know who owns the apartment complex?"}, {"speaker": "Caller", "text": "Yes, it’s Cedar Oaks Apartments."}, {"speaker": "Intake Specialist", "text": "Great, thank you for that. Have you had a chance to exchange insurance information with anyone from Cedar Oaks Apartments?"}, {"speaker": "Caller", "text": "I didn’t get any insurance details from them. I’m not sure if they even have insurance for situations like this."}, {"speaker": "Intake Specialist", "text": "That’s understandable. Given that Cedar Oaks is a major corporation, they should have some form of liability insurance. It might be worth looking into. Did you happen to speak to any staff or management after your fall?"}, {"speaker": "Caller", "text": "I reported it to the office, but no one really followed up with me."}, {"speaker": "Intake Specialist", "text": "I see. It’s crucial that they document incidents like this, especially if injuries are involved. You mentioned that you’re dealing with lingering nerve pain. Has your doctor indicated if there might be any long-term effects from your injuries?"}, {"speaker": "Caller", "text": "They said it’s hard to tell right now, but the nerve pain is concerning. It’s affecting my daily life."}, {"speaker": "Intake Specialist", "text": "That sounds really challenging. Have you had to miss work or change your routine because of your injuries?"}, {"speaker": "Caller", "text": "Yes, I’ve missed a few days of work, and it’s hard to do normal things like typing or lifting things."}, {"speaker": "Intake Specialist", "text": "I can imagine how difficult that must be. Thank you for sharing all of this. Since your injuries seem to be affecting your daily life and work, that’s definitely something to consider moving forward. Have you already spoken with another attorney about this incident?"}, {"speaker": "Caller", "text": "No, I haven't talked to anyone else yet."}, {"speaker": "Intake Specialist", "text": "Okay, that’s good to know. It sounds like you might have a case for premises liability, given the circumstances. I’ll make sure to pass this information along to one of our attorneys so they can review it. \n\nBefore we wrap up, can you confirm that the accident location was at Cedar Oaks Apartments in Chicago, IL?"}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Thank you! Just to summarize what we talked about: You fell down poorly lit stairs at Cedar Oaks Apartments on October 7th, resulting in a broken wrist and lingering nerve pain. You’ve sought medical treatment, including physical therapy, and you reported the incident to the apartment office but didn’t get any follow-up or insurance information. Is there anything else you’d like to add or any other questions you have for me?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’ll make sure to pass this information to one of our attorneys, and they will get back to you soon. We work on a contingency fee basis, so you won’t have to pay anything upfront. If you have any other questions or need further assistance, don’t hesitate to reach out. Take care, and I hope you feel better soon!"}, {"speaker": "Caller", "text": "Thank you, Diana. I appreciate it."}, {"speaker": "Intake Specialist", "text": "You’re welcome! Have a great day!"}], "outcome_status": "trial", "outcome_value": 1500000}
{"id": "f76489cf-bb4f-4ba8-9d8a-fad79b925a5a", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Alex. I’m calling about an accident I had with a step ladder."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that! I’d like to gather some details so we can understand your situation better. Could you tell me when the accident occurred?"}, {"speaker": "Caller", "text": "Sure, it happened on August 29th of this year."}, {"speaker": "Intake Specialist", "text": "Thank you for that. And where did the accident take place?"}, {"speaker": "Caller", "text": "It happened in Boston, MA."}, {"speaker": "Intake Specialist", "text": "Got it. Can you walk me through what happened during the incident?"}, {"speaker": "Caller", "text": "Yes, I was using a CookFast Pro 8-quart step ladder to reach some items on a shelf. It just collapsed while I was on it—totally unexpected."}, {"speaker": "Intake Specialist", "text": "That sounds really scary! I can imagine that must have been quite a shock. Were you injured in the fall?"}, {"speaker": "Caller", "text": "Yes, I ended up spraining my ankle and got some deep contusions on my legs."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. Those injuries sound painful. Have you sought medical attention for them?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital the same day. They confirmed the sprained ankle and treated the contusions."}, {"speaker": "Intake Specialist", "text": "It's good that you received care right away. Now, regarding the ladder itself, do you know if it was still under warranty or if there were any safety recalls associated with it?"}, {"speaker": "Caller", "text": "I’m not sure about recalls, but I believe it was purchased recently. The manufacturer is quite well-known—CookFast."}, {"speaker": "Intake Specialist", "text": "That’s helpful information. It sounds like a reputable company. Did you happen to exchange any insurance information with anyone regarding the ladder, or do you know if the manufacturer has liability insurance?"}, {"speaker": "Caller", "text": "I didn’t get any insurance details, but I assume a large company like that has coverage."}, {"speaker": "Intake Specialist", "text": "Yes, it’s likely they do. It’s also important to know if there were any witnesses to the accident. Were there any bystanders who saw what happened?"}, {"speaker": "Caller", "text": "No, I was alone when it happened."}, {"speaker": "Intake Specialist", "text": "I see. That could make things a bit more challenging when it comes to establishing liability. Speaking of liability, can you tell me if you believe the ladder was defective or if there was some other factor that led to the collapse?"}, {"speaker": "Caller", "text": "I think it might have been defective. It just didn’t feel stable at all, and I was using it as instructed."}, {"speaker": "Intake Specialist", "text": "That’s definitely a crucial detail. It sounds like you were following the proper usage guidelines. Now, have you already spoken with another attorney about this situation?"}, {"speaker": "Caller", "text": "Yes, I have. I wanted to see what my options are."}, {"speaker": "Intake Specialist", "text": "Thank you for letting me know. It’s good to have that perspective. Just to clarify, are they still representing you, or are you exploring other options?"}, {"speaker": "Caller", "text": "They are still representing me, but I wanted a second opinion."}, {"speaker": "Intake Specialist", "text": "That makes sense. I appreciate your honesty. Now, could you tell me if you had any pre-existing injuries or health conditions that could relate to your current injuries?"}, {"speaker": "Caller", "text": "I had a couple of old injuries from sports, but nothing that affected my ankle or legs."}, {"speaker": "Intake Specialist", "text": "Thank you for being upfront about that. It’s important for us to have a complete picture. Now, regarding your current injuries, have you incurred any medical expenses or lost wages due to your inability to work since the accident?"}, {"speaker": "Caller", "text": "Yes, I’ve had a few medical bills from the hospital visit, and I’ve missed work for a week so far."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. Those additional costs can be overwhelming. It sounds like you're facing some significant challenges. Can you tell me if there have been any ongoing treatments or follow-ups since your initial visit?"}, {"speaker": "Caller", "text": "I have a follow-up appointment next week, but I’m not sure how long the recovery is going to take."}, {"speaker": "Intake Specialist", "text": "That’s understandable. Recovery time can vary, especially with injuries like sprains. Just to summarize, you've experienced a ladder collapse while using a CookFast Pro step ladder, leading to a sprained ankle and deep contusions. You’ve sought medical attention, and you’re currently working with another attorney while considering your options. \n\nI’ll pass this information along to one of our attorneys who will review it and get back to you. In the meantime, if you have any other questions about the process or our fees, feel free to ask!"}, {"speaker": "Caller", "text": "No, I think that covers everything for now. Thank you for your help, Alex."}, {"speaker": "Intake Specialist", "text": "You’re welcome! I’m glad I could assist you. We’ll be in touch soon, and I hope you have a smooth recovery. Take care!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "45e61237-c1fb-4c64-84ce-61f5b6978548", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I was involved in an accident and I’d like to talk about it."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear that. I’d be happy to help you out. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It happened on March 30, 2025. I was walking outside an office building in Chicago, and I tripped over an uneven sidewalk slab."}, {"speaker": "Intake Specialist", "text": "That sounds really unfortunate. I hope you’re doing okay now. Can you tell me about any injuries you sustained from the fall?"}, {"speaker": "Caller", "text": "Yes, I ended up getting second-degree burns on my left arm. It was pretty painful."}, {"speaker": "Intake Specialist", "text": "That sounds really tough. I’m sorry you had to go through that. How did the burns happen? Was there something on the sidewalk that caused the burns?"}, {"speaker": "Caller", "text": "No, it wasn’t that. I fell and landed on some hot metal that was near the sidewalk. I think it was from some construction work going on nearby."}, {"speaker": "Intake Specialist", "text": "I see. Thank you for clarifying that. It sounds like there might be a few factors at play here. Did you happen to get any information about the property owner or the location where this happened?"}, {"speaker": "Caller", "text": "Yes, the property is managed by the City of Springfield Public Works."}, {"speaker": "Intake Specialist", "text": "Great, that’s important information. Have you been able to exchange any insurance information regarding this incident?"}, {"speaker": "Caller", "text": "I didn’t get any insurance information at the scene. I’m not sure if they have insurance for this kind of thing."}, {"speaker": "Intake Specialist", "text": "That’s understandable. Since it’s a city-managed property, they typically have liability coverage for such incidents. Have you considered whether you might want to pursue a claim against them?"}, {"speaker": "Caller", "text": "I hadn’t really thought about it before. I just wanted to understand my options."}, {"speaker": "Intake Specialist", "text": "Absolutely, it's good to explore your options. I want to make sure we gather all the necessary details. Did you happen to take any photos of the sidewalk or the area where you tripped?"}, {"speaker": "Caller", "text": "No, I didn’t think to take photos at the time. I was just focused on getting medical help."}, {"speaker": "Intake Specialist", "text": "That makes sense. Seeking medical help is the most important thing. Did you visit a doctor or get any treatment for your burns?"}, {"speaker": "Caller", "text": "Yes, I went to the emergency room right after the incident. They treated my burns but it was a painful experience."}, {"speaker": "Intake Specialist", "text": "I can imagine how distressing that must have been. Have you received any follow-up care or treatment since then?"}, {"speaker": "Caller", "text": "Yes, I’ve been going to a burn clinic for the past few weeks for dressing changes and therapy."}, {"speaker": "Intake Specialist", "text": "I’m glad to hear you’re getting the care you need. Have you had any time off work or school because of your injuries?"}, {"speaker": "Caller", "text": "I’ve had to miss a few days of school, which has been really frustrating."}, {"speaker": "Intake Specialist", "text": "I can understand how that would be difficult, especially as a student. Have you had any other expenses related to this incident, like medical bills or travel costs to get to the clinic?"}, {"speaker": "Caller", "text": "Yes, my parents have had to pay for the medical bills, and it’s starting to add up."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. It’s really frustrating when accidents lead to unexpected expenses. Do you have any documentation of your medical expenses or treatment?"}, {"speaker": "Caller", "text": "Yes, we’ve kept all the paperwork from the emergency room and the burn clinic."}, {"speaker": "Intake Specialist", "text": "That’s great. Having that documentation will be helpful if you decide to move forward with a claim. Have you spoken to any other attorneys about this situation?"}, {"speaker": "Caller", "text": "No, you’re the first ones I’m reaching out to."}, {"speaker": "Intake Specialist", "text": "Thank you for trusting us with your case. It sounds like you have a solid basis for a potential claim, especially with the clear liability on the property owner’s part. Just to confirm, you mentioned the City of Springfield Public Works is the property owner, correct?"}, {"speaker": "Caller", "text": "Yes, that’s right."}, {"speaker": "Intake Specialist", "text": "Perfect. Now, I want to make sure I have everything clear. You were walking outside an office building in Chicago on March 30, 2025, when you tripped over an uneven sidewalk slab. You sustained second-degree burns on your left arm, received treatment at the emergency room and have been going to a burn clinic since. Your medical expenses are accumulating, and you missed some school due to the injury. You haven’t spoken to any other attorneys yet, correct?"}, {"speaker": "Caller", "text": "Yes, that’s all accurate."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. I’ll pass this information along to one of our attorneys who will review your case and get back to you about the next steps. We work on a contingency fee basis, meaning you don’t pay anything unless we recover compensation for you."}, {"speaker": "Caller", "text": "That sounds good. Thank you so much, Diana."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! If you have any more questions in the meantime, please don’t hesitate to reach out. We’re here to help. I wish you a speedy recovery, and we’ll be in touch soon!"}, {"speaker": "Caller", "text": "Thank you. I appreciate it."}, {"speaker": "Intake Specialist", "text": "Take care!"}], "outcome_status": "settled", "outcome_value": 15000}
{"id": "89f82028-fdc3-41aa-9778-7e12874bb76b", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda, I’m calling about a dog bite incident that happened a while back."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you’ve been through that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on January 14, 2021, at a public park in Colorado. I was just walking when an off-leash Rottweiler ran up to me and bit my ankle."}, {"speaker": "Intake Specialist", "text": "That sounds really distressing. Did you receive any medical treatment for your injuries?"}, {"speaker": "Caller", "text": "Yes, I ended up spraining my ankle and had some pretty deep contusions. I didn’t go to the doctor right away, though."}, {"speaker": "Intake Specialist", "text": "I understand. Delayed medical treatment can happen for a variety of reasons. How long after the incident did you seek treatment?"}, {"speaker": "Caller", "text": "I waited about a week before I finally went to see a doctor. I thought it might get better on its own, but it just didn’t."}, {"speaker": "Intake Specialist", "text": "That makes sense. Sometimes injuries can take time to show how serious they are. Did you happen to get the dog owner's information or any details about their insurance?"}, {"speaker": "Caller", "text": "Yes, I got their name and they mentioned they had homeowner’s insurance."}, {"speaker": "Intake Specialist", "text": "That's great to hear. It’s important to have that information. Were you able to exchange insurance details with them?"}, {"speaker": "Caller", "text": "Yes, we exchanged information. I have the name of their insurance company."}, {"speaker": "Intake Specialist", "text": "Perfect. That will be very helpful as we move forward. Now, can you tell me if there were any witnesses to the incident?"}, {"speaker": "Caller", "text": "There were a couple of people nearby who saw what happened, but I didn’t get their names."}, {"speaker": "Intake Specialist", "text": "I see. Having witnesses can sometimes strengthen a case, but it sounds like you have a solid foundation already. Can you share how the incident has affected you since then, especially regarding your injuries?"}, {"speaker": "Caller", "text": "Well, my ankle still bothers me sometimes, especially if I’m on my feet for a long time. The contusions were pretty painful, but they healed up."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you’re still dealing with discomfort. Have you had to miss work or change any of your daily activities because of your injuries?"}, {"speaker": "Caller", "text": "I had to take some time off work, about a week, and I’ve had to limit some activities like hiking and running, which I really enjoy."}, {"speaker": "Intake Specialist", "text": "That sounds frustrating, especially since those activities are part of your routine. Are there any other expenses or damages related to the incident that you’ve incurred?"}, {"speaker": "Caller", "text": "I didn’t have to pay for any medical bills since I waited so long, but I did have to buy some over-the-counter pain relief."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. It sounds like the injuries have impacted your quality of life, even if the financial damages are minimal at this point. Have you spoken to any other attorneys about this case?"}, {"speaker": "Caller", "text": "No, I haven’t contacted anyone else. I wanted to get a better understanding of what my options are."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable, and I’m glad you reached out to us. Based on what you’ve shared, it seems like there is clear liability on the part of the dog owner since it was off-leash in a public space."}, {"speaker": "Caller", "text": "Yes, I think so too."}, {"speaker": "Intake Specialist", "text": "And with the homeowner’s insurance in play, we may have a good chance of addressing your case effectively. I’ll be passing this information on to one of our attorneys who will review it and get back to you."}, {"speaker": "Caller", "text": "That sounds good. What’s the next step after that?"}, {"speaker": "Intake Specialist", "text": "Once the attorney reviews your case, they will reach out to discuss it in more detail. They’ll also explain the next steps and how we can assist you further. Just so you know, we work on a contingency fee basis, which means you won’t owe any legal fees unless we successfully recover money for you."}, {"speaker": "Caller", "text": "That’s good to know."}, {"speaker": "Intake Specialist", "text": "Absolutely. Is there anything else you would like to discuss or ask about while I have you on the line?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now."}, {"speaker": "Intake Specialist", "text": "Great! Just to summarize, you had a dog bite incident on January 14, 2021, in Colorado, resulting in a sprained ankle and deep contusions. You had delayed medical treatment but have since been affected in your daily activities. You have the dog owner's homeowner’s insurance information and didn't consult with any other attorneys. I’ll make sure this information goes to one of our attorneys, and they will be in touch soon."}, {"speaker": "Caller", "text": "Thank you, Brenda. I appreciate your help."}, {"speaker": "Intake Specialist", "text": "You’re welcome! Thank you for reaching out today. Take care, and we’ll be in touch soon!"}], "outcome_status": "settled", "outcome_value": 15000}
{"id": "5230d1ca-be91-46a0-9241-46f7f37c50f3", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Alex. I wanted to talk about a dog bite incident that happened recently."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you were involved in an incident like that. I’d be happy to help you gather some information. Can you start by telling me when and where this happened?"}, {"speaker": "Caller", "text": "Sure, it happened on May 1st, 2024, in the hallway of my apartment building in Denver."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. Can you describe what happened during the incident?"}, {"speaker": "Caller", "text": "Yeah, I was just walking down the hallway when my neighbor’s pit bull suddenly came out and attacked me. It was really unexpected."}, {"speaker": "Intake Specialist", "text": "That sounds really frightening! I hope you’re doing okay. Did you sustain any injuries from the attack?"}, {"speaker": "Caller", "text": "Yes, I ended up with a sprained ankle and some pretty deep contusions on my arm."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. It sounds painful. Have you sought any medical treatment for your injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the urgent care right after the incident and they treated me for the sprained ankle and the bruising."}, {"speaker": "Intake Specialist", "text": "That’s good that you got medical attention. Now, regarding the dog and the owner, do you know if your neighbor has any insurance that might cover this incident, like homeowner’s or renter’s insurance?"}, {"speaker": "Caller", "text": "I’m not sure. I didn’t ask them about their insurance details. I was just focused on getting help for my injuries."}, {"speaker": "Intake Specialist", "text": "That’s understandable. Sometimes these situations can be overwhelming. Do you remember if the dog has a history of aggression or if there have been any previous incidents involving this dog?"}, {"speaker": "Caller", "text": "I don’t know about any past incidents, but I’ve heard some neighbors mention that the dog can be aggressive sometimes."}, {"speaker": "Intake Specialist", "text": "That’s important information to consider. In terms of liability, did you notice if there were any witnesses to the incident, or did anyone else see what happened?"}, {"speaker": "Caller", "text": "Yeah, there was another neighbor who saw it happen. I think they could confirm what happened."}, {"speaker": "Intake Specialist", "text": "That’s helpful to know. Having a witness can definitely support your case. Now, did you manage to exchange any information with your neighbor after the incident, like their contact details or any insurance information?"}, {"speaker": "Caller", "text": "No, I didn’t get that information. I was pretty shaken up, and I just left to go to the hospital."}, {"speaker": "Intake Specialist", "text": "I completely understand. It’s tough to think clearly in such a stressful situation. As for your injuries, have you been able to return to work or any of your normal activities since the incident?"}, {"speaker": "Caller", "text": "Not really. I’ve had to take some time off work because I can’t walk properly with my ankle. It’s been really frustrating."}, {"speaker": "Intake Specialist", "text": "I can only imagine how difficult that must be. It sounds like this incident has impacted your daily life quite a bit. Have you kept track of any medical expenses or other costs associated with your treatment so far?"}, {"speaker": "Caller", "text": "Yes, I have some receipts from the urgent care visit and a few follow-up appointments. I haven’t added everything up yet, though."}, {"speaker": "Intake Specialist", "text": "That’s great that you’re keeping those records. It will be helpful for your case. Just to clarify, do you currently have any other attorney representing you regarding this incident?"}, {"speaker": "Caller", "text": "No, I don’t have anyone else helping me right now."}, {"speaker": "Intake Specialist", "text": "Thanks for letting me know. It sounds like you’re in the early stages of figuring things out. I want to make sure you’re feeling supported. Is there anything specific you’d like to know about the process moving forward?"}, {"speaker": "Caller", "text": "I guess I’m just unsure about what my options are and how I should proceed."}, {"speaker": "Intake Specialist", "text": "Absolutely, that’s completely understandable. Generally, we can help you evaluate your case and determine if you have a valid claim against the dog owner. Since we work on a contingency fee basis, you won’t have to pay anything upfront. We only get paid if you win your case."}, {"speaker": "Caller", "text": "That sounds fair. What happens next if I decide to move forward?"}, {"speaker": "Intake Specialist", "text": "If you choose to proceed, I’ll pass along all the information you’ve shared with me to one of our attorneys. They’ll review your case and reach out to you to discuss the next steps in more detail."}, {"speaker": "Caller", "text": "Okay, that sounds good."}, {"speaker": "Intake Specialist", "text": "Perfect. Just to summarize, you were attacked by your neighbor’s pit bull in your apartment hallway on May 1st, you suffered a sprained ankle and deep contusions, and you did go to urgent care for treatment. You don’t have any current representation, and you’re unsure about the neighbor’s insurance coverage."}, {"speaker": "Caller", "text": "Yes, that’s all correct."}, {"speaker": "Intake Specialist", "text": "Great! I’ll make sure to pass this information along. Is there anything else you’d like to add or ask before we wrap up?"}, {"speaker": "Caller", "text": "No, I think that covers everything I wanted to discuss. Thank you for your help."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you. One of our attorneys will be in touch with you soon to discuss your case further. Take care and don’t hesitate to reach out if you have any other questions in the meantime."}, {"speaker": "Caller", "text": "Thank you, I appreciate it."}, {"speaker": "Intake Specialist", "text": "Absolutely! Have a good day!"}], "outcome_status": "settled", "outcome_value": 60000}
{"id": "670c7c62-012d-4fe2-a63e-983303e039d6", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I’m calling because I was bitten by a dog recently, and I’m not sure what to do next."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Dog bites can be quite traumatic. Can you tell me a bit more about the incident? When did it happen?"}, {"speaker": "Caller", "text": "It happened on May 2nd of this year in a public park here in Phoenix."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. Was the dog on a leash, or was it off-leash when the bite occurred?"}, {"speaker": "Caller", "text": "It was off-leash. The owner was nearby, but they didn't have it under control."}, {"speaker": "Intake Specialist", "text": "That sounds really distressing. Do you remember what breed the dog was?"}, {"speaker": "Caller", "text": "Yes, it was a Rottweiler."}, {"speaker": "Intake Specialist", "text": "Rottweilers can be quite strong. Can you describe what happened leading up to the bite?"}, {"speaker": "Caller", "text": "I was just walking in the park, and the dog ran up to me. I didn’t think much of it at first, but then it suddenly lunged and bit my leg."}, {"speaker": "Intake Specialist", "text": "That sounds frightening. I hope you're okay. Did you seek any medical attention after the incident?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right away. They told me I have a compound fracture of my tibia."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear about your injury; that sounds painful. Have you been able to get treatment for that since the incident?"}, {"speaker": "Caller", "text": "Yes, I’m currently in physical therapy, but it’s been tough."}, {"speaker": "Intake Specialist", "text": "I can only imagine how challenging that must be. It’s important to focus on your recovery. Now, regarding the dog’s owner, did you exchange any insurance information with them?"}, {"speaker": "Caller", "text": "Yes, I found out that they have homeowner's insurance."}, {"speaker": "Intake Specialist", "text": "That’s good to know. Having homeowner's insurance can be a key factor in these cases. Did you get the name of the insurance company?"}, {"speaker": "Caller", "text": "Yes, it was XYZ Insurance."}, {"speaker": "Intake Specialist", "text": "Great, that gives us a starting point. Do you know if the owner has a history of the dog being aggressive or any prior incidents?"}, {"speaker": "Caller", "text": "I really don’t know. The owner didn’t mention anything like that."}, {"speaker": "Intake Specialist", "text": "Understood. It can be hard to gather that kind of information at the moment. Have you been able to gather any evidence, like photos of the injury or witness statements?"}, {"speaker": "Caller", "text": "I took some photos of my leg after it happened, but I don't have any witness statements."}, {"speaker": "Intake Specialist", "text": "Those photos will be helpful. Thank you for mentioning that. It seems like there might be a couple of challenges due to the lack of witnesses and the dog's behavior not being documented before. Have you spoken to any other attorneys about this case?"}, {"speaker": "Caller", "text": "No, you’re the first place I’m calling."}, {"speaker": "Intake Specialist", "text": "I appreciate that, and I'm glad you reached out to us. I have to ask, have you had any pre-existing injuries or conditions related to your leg before this incident?"}, {"speaker": "Caller", "text": "No, I haven’t had any issues with that leg before this."}, {"speaker": "Intake Specialist", "text": "That’s good to hear. It’s important for us to know that information. So, just to summarize what we’ve discussed: You were bitten by an off-leash Rottweiler in a park on May 2nd, resulting in a compound fracture of your tibia, and you’re currently receiving physical therapy. The dog’s owner has homeowner's insurance with XYZ Insurance, but we don't have witness statements or any history of the dog’s behavior. Is that correct?"}, {"speaker": "Caller", "text": "Yes, that’s right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. I’ll pass this information along to one of our attorneys, who will review your case and get back to you. They’ll be able to provide you with the next steps. Do you have any questions for me before we wrap up?"}, {"speaker": "Caller", "text": "No, I think you covered everything. Thank you for your help, Diana."}, {"speaker": "Intake Specialist", "text": "Of course! I’m happy to help. You should hear back from us soon. Take care of yourself, and we’ll be in touch shortly."}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "e436f6eb-c84f-4634-b89c-7a8bda66d1be", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I was in a motorcycle accident a little while ago, and I’m looking for some help."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you were involved in an accident. I’d be happy to help you with that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on October 27, 2022, in Seattle. I was sideswiped by a rideshare driver while I was on my motorcycle."}, {"speaker": "Intake Specialist", "text": "That sounds really unsettling. I can only imagine how that must have felt. Do you remember the details of how the accident occurred?"}, {"speaker": "Caller", "text": "Yeah, I was in the lane, and the rideshare SUV just came out of nowhere and hit me. There wasn't really any warning."}, {"speaker": "Intake Specialist", "text": "It sounds like the other driver may have been at fault. Did you exchange insurance information with the rideshare driver?"}, {"speaker": "Caller", "text": "Yes, we did. They had a standard auto policy, but I’m not sure about the details."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you exchanged information. Having their insurance details is really important for your case. Now, can you tell me about your injuries? You mentioned you were hurt in the accident."}, {"speaker": "Caller", "text": "Yes, I broke my wrist, and I’ve been dealing with some lingering nerve pain since then. It’s been pretty tough."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear about your injuries. It sounds like you've been through a lot. Have you received any medical treatment for your wrist and nerve pain since the accident?"}, {"speaker": "Caller", "text": "I did, but I delayed going to the doctor for a while because I thought it was just a sprain. By the time I went, my wrist was definitely broken, and the nerve pain had started."}, {"speaker": "Intake Specialist", "text": "It’s understandable that you might have thought it was just a sprain initially. It’s great that you eventually sought medical help. Have you been following up with any treatments or therapies?"}, {"speaker": "Caller", "text": "Yes, I’ve been going to physical therapy, but the pain is still there."}, {"speaker": "Intake Specialist", "text": "That must be frustrating, especially since you’re working hard to recover. Have you kept all your medical records and bills related to the accident?"}, {"speaker": "Caller", "text": "Yes, I have everything documented, including all the treatments I've received."}, {"speaker": "Intake Specialist", "text": "Perfect, having those records will be very helpful for your case. Just to clarify, have you spoken to another attorney about this accident, or are we the first ones you’re reaching out to?"}, {"speaker": "Caller", "text": "No, I haven’t talked to anyone else yet."}, {"speaker": "Intake Specialist", "text": "Thank you for letting me know. It’s good to hear that you’re reaching out to us first. Now, regarding the other driver’s insurance, do you happen to know the name of the company?"}, {"speaker": "Caller", "text": "I think it was XYZ Insurance, but I’m not entirely sure."}, {"speaker": "Intake Specialist", "text": "That’s a good start! If you can find any documents related to the accident, that should have more details on the insurance. It’s also important for us to know what your overall damages look like. Have you missed work or incurred any expenses because of your injuries?"}, {"speaker": "Caller", "text": "Yes, I had to take some time off work for recovery, and I've also had to pay for the physical therapy sessions."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. It’s tough when an accident affects your ability to work and incurs extra expenses. Thank you for sharing that with me. Just to summarize, you were in a motorcycle accident on October 27, 2022, in Seattle, where you were sideswiped by a rideshare driver. You sustained a broken wrist and some lingering nerve pain, and you’ve been receiving medical treatment. You also have documentation of your medical records and bills."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Great! I’ll pass all of this information on to one of our attorneys, who will review it and get back to you. They’ll be able to discuss your options and next steps with you. Do you have any questions for me while we’re on the line?"}, {"speaker": "Caller", "text": "Not right now, I think you covered everything."}, {"speaker": "Intake Specialist", "text": "Alright! Thank you for sharing your story with me today. I know it can be tough to talk about these experiences. We appreciate your trust in us. You should hear back from our attorney soon. Have a great day, and take care!"}, {"speaker": "Caller", "text": "Thank you, Diana. I appreciate your help."}, {"speaker": "Intake Specialist", "text": "You’re welcome! Bye for now!"}], "outcome_status": "settled", "outcome_value": 90000}
{"id": "234836ec-29a5-4d62-b7a2-9d6ec1e0e8be", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Alex, I’m calling because I was bitten by a dog a few months ago, and I’m trying to figure out my options."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Dog bites can be quite serious. Can you tell me a little more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on May 7th, in a public park in Boston. I was just walking when an off-leash dog ran up to me and bit my arm."}, {"speaker": "Intake Specialist", "text": "That sounds really frightening. I hope you’re doing okay now. Did you seek any medical attention for the bite?"}, {"speaker": "Caller", "text": "Yes, I did. I ended up with a torn rotator cuff from trying to pull away, and I had to go through physical therapy."}, {"speaker": "Intake Specialist", "text": "I'm sorry to hear that you sustained such an injury. It sounds like it’s been a tough recovery. Did you happen to get any information from the dog owner, like their insurance details?"}, {"speaker": "Caller", "text": "Yes, the owner said they had homeowner's insurance. I didn’t get the exact policy details, though."}, {"speaker": "Intake Specialist", "text": "That’s good that you were able to get their insurance information. Do you remember the name of the insurance company?"}, {"speaker": "Caller", "text": "I believe it was Allstate."}, {"speaker": "Intake Specialist", "text": "Great, that helps a lot. Now, can you tell me more about the circumstances surrounding the incident? For example, were there any witnesses around, or did anyone else see what happened?"}, {"speaker": "Caller", "text": "There were a few people in the park, but I didn’t get anyone’s contact information. I was just focused on dealing with the bite."}, {"speaker": "Intake Specialist", "text": "Understandable. Sometimes those moments can be quite overwhelming. Did you report the incident to anyone, like park officials or animal control?"}, {"speaker": "Caller", "text": "No, I didn’t report it. I just wanted to get home and take care of my injury."}, {"speaker": "Intake Specialist", "text": "That makes sense. It’s important to focus on your health first. Have you had any ongoing issues with your shoulder since the injury, or any other medical treatments?"}, {"speaker": "Caller", "text": "Yes, I still have some pain, and I've had to go to physical therapy for several weeks. It’s been pretty frustrating."}, {"speaker": "Intake Specialist", "text": "I can imagine. Chronic pain can really affect your daily life. Have you missed any work because of this injury?"}, {"speaker": "Caller", "text": "Yes, I’ve missed quite a bit of work. I had to take time off to recover."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Losing work can be tough, especially when you’re already dealing with an injury. Just to confirm, do you have another attorney representing you in this matter?"}, {"speaker": "Caller", "text": "No, I don’t. I haven't talked to anyone else about it yet."}, {"speaker": "Intake Specialist", "text": "That’s helpful to know. Based on what you’ve shared, it seems like there is some potential for a claim, especially since the dog owner has homeowner's insurance. It’s important to gather as much information as possible. Have you documented your injuries or any medical expenses related to your treatment?"}, {"speaker": "Caller", "text": "Yes, I have all my medical records and bills. I’ve been keeping track of everything."}, {"speaker": "Intake Specialist", "text": "That’s great to hear. Keeping records will definitely help move things along if you decide to pursue a claim. Now, since you mentioned the dog was off-leash, do you remember if there were any posted signs in the park about leash laws?"}, {"speaker": "Caller", "text": "I didn’t see any signs, but I’m not sure if there were any."}, {"speaker": "Intake Specialist", "text": "I see. Leash laws can vary, and that might be relevant. It sounds like we have a good amount of information. To summarize, you were bitten by an off-leash mixed-breed dog in a public park on May 7th, you sustained a torn rotator cuff, and you’ve been in physical therapy. You have the owner's homeowner’s insurance information with the company being Allstate, and you’ve kept records of your medical expenses."}, {"speaker": "Caller", "text": "Yes, that's correct."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. I’ll make sure this information is passed along to one of our attorneys who will review it and get back to you. They can discuss your options in more detail. Is there anything else you would like to ask or any other information you think might be relevant?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now. Thank you for your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I know it can be a lot to handle, and I appreciate you sharing your story with me. Someone from our team will be in touch soon to discuss the next steps. Take care, and I hope you feel better soon!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "268a2b27-db67-41da-a273-74e869f9ac91", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thanks for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda, I was in a car accident recently, and I need some help."}, {"speaker": "Intake Specialist", "text": "I'm really sorry to hear that you were in an accident. I’m here to gather some information so we can see how we might assist you. Can you tell me a bit about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on November 11th, and I was driving my pickup truck. There was really heavy fog, and I ended up in a multi-car pile-up."}, {"speaker": "Intake Specialist", "text": "That sounds really scary! Heavy fog can make driving really dangerous. How many vehicles were involved in the pile-up?"}, {"speaker": "Caller", "text": "I’m not exactly sure, but I know there were at least three or four other cars, including a delivery van."}, {"speaker": "Intake Specialist", "text": "Got it. And were you able to exchange insurance information with the other drivers involved?"}, {"speaker": "Caller", "text": "I did get the delivery van driver's information, but I’m not sure about the others."}, {"speaker": "Intake Specialist", "text": "That’s helpful. Do you know the name of the insurance company for the delivery van?"}, {"speaker": "Caller", "text": "Yes, they mentioned they were insured with a company called Nationwide."}, {"speaker": "Intake Specialist", "text": "Great, that’s good to know. Let’s talk a bit about your injuries. How have you been feeling since the accident?"}, {"speaker": "Caller", "text": "I sustained some pretty serious injuries. I had lacerations that required about 30 stitches."}, {"speaker": "Intake Specialist", "text": "Oh no, that sounds painful. I hope you’re on the mend now. Have you needed any follow-up medical treatment for those injuries?"}, {"speaker": "Caller", "text": "Yes, I had to go back for a follow-up, and they said I might need physical therapy as well."}, {"speaker": "Intake Specialist", "text": "That’s understandable, especially with injuries like that. Aside from the physical injuries, have you experienced any emotional distress or difficulties since the accident?"}, {"speaker": "Caller", "text": "Yeah, I’ve been feeling really anxious about driving now. It’s been tough."}, {"speaker": "Intake Specialist", "text": "I can imagine that would be challenging. It’s completely normal to feel that way after such a traumatic experience. Now, have you been able to talk to any other attorneys about your case, or are we the first?"}, {"speaker": "Caller", "text": "You’re the first I’m reaching out to."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that with me. Based on what you’ve told me, it sounds like you’ve been through a lot. I want to make sure we have everything we need to move forward. Can you tell me a bit more about the circumstances of the accident? Was there any other factor you think contributed to the pile-up, like traffic conditions or something else?"}, {"speaker": "Caller", "text": "I think the fog was the biggest factor. It was just so thick that visibility was almost zero."}, {"speaker": "Intake Specialist", "text": "That makes sense. Weather conditions can certainly play a big role in accidents like that. Were there any police officers at the scene, and did they file a report?"}, {"speaker": "Caller", "text": "Yes, the police came, and I believe they did file a report. I think it’s available if we need it."}, {"speaker": "Intake Specialist", "text": "That’s important information. Thank you for mentioning that! Now, regarding insurance, aside from the delivery van, do you know if the other drivers had insurance or if they were able to provide their information?"}, {"speaker": "Caller", "text": "I didn’t get any names or info from the other drivers. Everything happened so quickly."}, {"speaker": "Intake Specialist", "text": "I understand; it can be overwhelming in those moments. Just to confirm, have you contacted your own insurance company about the accident?"}, {"speaker": "Caller", "text": "I did, but they said they couldn’t give me much help without knowing the other parties’ coverage."}, {"speaker": "Intake Specialist", "text": "That can be frustrating. It’s good that you reached out to them. Since you’ve mentioned some significant injuries and the situation with the insurance, it sounds like you may have a potential case here. I’ll pass this information to one of our attorneys, who will review everything and get back to you with next steps."}, {"speaker": "Caller", "text": "That sounds good. What about fees? How does that work?"}, {"speaker": "Intake Specialist", "text": "We work on a contingency fee basis, which means you don’t pay anything upfront. We only collect a fee if we secure a settlement or win your case. So, there's no financial risk for you at this stage."}, {"speaker": "Caller", "text": "Okay, that makes sense."}, {"speaker": "Intake Specialist", "text": "Great! Just to recap what we’ve discussed: You were in a multi-car pile-up on November 11th in heavy fog while driving your pickup truck. You sustained serious injuries, including lacerations requiring 30 stitches, and you have been feeling anxious about driving since the accident. You exchanged insurance information with the delivery van driver, who is insured by Nationwide, but didn’t get details from the other drivers. You haven’t spoken to any other attorneys yet, and the police did file a report at the scene."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Perfect! I’ll make sure this information gets to one of our attorneys as soon as possible. They’ll reach out to you once they’ve had a chance to review your case. Do you have any other questions for me while we’re on the phone?"}, {"speaker": "Caller", "text": "No, I think I’m good for now. Thank you for your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m here to help. Take care, and we’ll be in touch soon."}], "outcome_status": "trial", "outcome_value": 0}
{"id": "b3479f71-50b1-43d2-b9b5-883817f4f11b", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, I’m calling about a dog bite incident that happened last year."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you went through that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on July 27, 2022. I was in the hallway of my apartment building when my neighbor's pit bull attacked me."}, {"speaker": "Intake Specialist", "text": "That sounds really distressing. Was the dog on a leash or in any kind of containment when the incident happened?"}, {"speaker": "Caller", "text": "No, it wasn’t on a leash. I didn’t even see it coming until it lunged at me."}, {"speaker": "Intake Specialist", "text": "I understand. It must have been quite a shock. Were there any witnesses to the attack, or was anyone else present at the time?"}, {"speaker": "Caller", "text": "Yes, there was a neighbor who saw the whole thing. They came out to help after the dog attacked me."}, {"speaker": "Intake Specialist", "text": "That’s good to know. Having a witness can be very helpful. Can you describe the injuries you sustained from the attack?"}, {"speaker": "Caller", "text": "I ended up with second-degree burns on my left arm. The dog bit me, and I had to get medical treatment for it."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you had to go through such painful injuries. Did you have to visit a hospital or receive any ongoing treatment?"}, {"speaker": "Caller", "text": "Yes, I went to the ER right after it happened. They treated the burns and gave me medication for the pain. I also had to follow up with my doctor a few times."}, {"speaker": "Intake Specialist", "text": "That sounds like a lot to deal with. I hope you're feeling better now. I'm curious, did you discuss the incident with your neighbor at all? Did they provide any insurance information or mention if they had coverage for the dog?"}, {"speaker": "Caller", "text": "They did give me their homeowner's insurance info, but I'm not sure what the coverage is like."}, {"speaker": "Intake Specialist", "text": "It's good that you have that information. Did you happen to exchange details with the insurance company or report the incident to them?"}, {"speaker": "Caller", "text": "I reported it to their insurance, but I haven't heard back from them since."}, {"speaker": "Intake Specialist", "text": "I see. That can be frustrating. Since this incident happened in a public area, are you aware if there are any city regulations or ordinances regarding dog ownership in your area?"}, {"speaker": "Caller", "text": "I’m not sure about that. I just know it was a scary experience."}, {"speaker": "Intake Specialist", "text": "Understandably so. It’s important to know if there might be any additional liability involved. Now, just to clarify, have you spoken with any other attorneys about this case, or are you currently working with someone?"}, {"speaker": "Caller", "text": "No, I haven’t had any other representation."}, {"speaker": "Intake Specialist", "text": "Thank you for that clarification. It sounds like you’ve been through quite a bit. I want to make sure we have all the details. Can you tell me if there was any time you had to take off work due to your injuries?"}, {"speaker": "Caller", "text": "Yes, I had to take about two weeks off to recover, and I missed some important meetings."}, {"speaker": "Intake Specialist", "text": "That definitely adds to the impact of the injuries. Are there any other damages or expenses you’ve incurred as a result of the attack?"}, {"speaker": "Caller", "text": "I had to pay for the medical bills, and I’m still dealing with the pain, which is really affecting my daily life."}, {"speaker": "Intake Specialist", "text": "I can imagine how challenging that must be. It sounds like you’ve faced significant physical and emotional impacts from this incident. Just to summarize what we've discussed: You were attacked by your neighbor's pit bull in the hallway of your apartment building, resulting in second-degree burns on your left arm. You sought medical treatment and had to take some time off work, and you've reported the incident to the dog owner's insurance. You haven’t worked with any other attorneys regarding this case."}, {"speaker": "Caller", "text": "That’s correct."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. I’ll pass this information along to one of our attorneys who will review it and get back to you. They’ll reach out to discuss the next steps and see how we can assist you further. Do you have any other questions for me at this time?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help!"}, {"speaker": "Intake Specialist", "text": "You're very welcome! I wish you the best, and I hope you feel better soon. Have a great day!"}], "outcome_status": "settled", "outcome_value": 70000}
{"id": "402df4d9-04fb-46c6-a2af-4d7a089bdc53", "transcript": [{"speaker": "Intake Specialist", "text": "Good morning! Thank you for calling Morgan & Associates. My name is Carlos. How can I help you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about a dog bite incident I was involved in."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Dog bites can be really traumatic. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on December 28th of last year. I was in the hallway of my apartment building when my neighbor's pit bull attacked me."}, {"speaker": "Intake Specialist", "text": "That sounds frightening. I hope you’re doing okay now. Can you describe the circumstances of the attack? Were you just walking by, or was there something specific that triggered the dog?"}, {"speaker": "Caller", "text": "I was just walking to my apartment. The dog suddenly came out of nowhere and lunged at me. There was no warning."}, {"speaker": "Intake Specialist", "text": "That must have been really shocking. Did you have any prior interactions with the dog, or was this the first time you encountered it?"}, {"speaker": "Caller", "text": "No, I hadn’t seen that dog before. I didn’t even know my neighbor had a pit bull."}, {"speaker": "Intake Specialist", "text": "I see. That adds to the confusion of the situation. What kind of injuries did you sustain from the bite?"}, {"speaker": "Caller", "text": "I had several lacerations on my arm and leg. I had to get about 30 stitches."}, {"speaker": "Intake Specialist", "text": "That sounds serious. I hope you’re healing well. Have you been able to seek any medical treatment for your injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after it happened. They treated the wounds and gave me a tetanus shot."}, {"speaker": "Intake Specialist", "text": "I’m glad you got the care you needed. Have you kept any medical records or bills related to that treatment?"}, {"speaker": "Caller", "text": "Yes, I have all the medical records and the bills from the hospital."}, {"speaker": "Intake Specialist", "text": "That’s great to hear. Documentation is really important. Now, can I ask about the other party involved? Did you manage to get any insurance information from your neighbor?"}, {"speaker": "Caller", "text": "Yes, the owner has homeowner's insurance, but I didn’t get the specific details."}, {"speaker": "Intake Specialist", "text": "That’s helpful to know that there’s homeowner's insurance coverage. Was there anything about the dog’s behavior that you think might indicate that the owner was negligent or should have done something differently to prevent the attack?"}, {"speaker": "Caller", "text": "I think it’s pretty irresponsible to have a dog like that in an apartment without proper control. I’ve heard other neighbors express concern about the dog, but I don’t know if that means anything legally."}, {"speaker": "Intake Specialist", "text": "That definitely adds context to the situation. It's useful to know that others have had concerns as well. Just to clarify, have you spoken to any other witnesses who might have seen the attack or know about the dog's behavior?"}, {"speaker": "Caller", "text": "No, I didn’t think to ask anyone. I was just really shaken up at the time."}, {"speaker": "Intake Specialist", "text": "Understandably so. That’s a lot to deal with in the moment. Have you already spoken to another attorney regarding this incident?"}, {"speaker": "Caller", "text": "Yes, I had a consultation with another lawyer, but I’m not sure if I want to go with them."}, {"speaker": "Intake Specialist", "text": "That’s completely fine. It’s important to find someone you feel comfortable with. Can I ask why you’re considering switching to us?"}, {"speaker": "Caller", "text": "I felt like they weren’t really paying attention to my case and didn’t ask a lot of questions."}, {"speaker": "Intake Specialist", "text": "I appreciate your honesty. We strive to take a thorough approach to understand your situation. Given the severity of your injuries, it sounds like you’re facing significant challenges. Have you missed any work because of this incident?"}, {"speaker": "Caller", "text": "Yes, I had to take two weeks off to recover."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. Missing work can add a lot of stress to an already tough situation. Are there any other impacts this incident has had on your daily life?"}, {"speaker": "Caller", "text": "I’ve been really anxious since the attack and I can’t walk through the hallways without feeling scared."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. It’s not just the physical injuries but the emotional toll as well. Have you thought about any therapy or counseling to help you cope with that anxiety?"}, {"speaker": "Caller", "text": "I haven’t really looked into it yet. I’m just focusing on healing right now."}, {"speaker": "Intake Specialist", "text": "That makes sense. Healing takes time, both physically and emotionally. Based on everything you've shared, I’ll pass this information to one of our attorneys, and they will review it thoroughly. They’ll reach out to you to discuss the next steps."}, {"speaker": "Caller", "text": "That sounds good. Is there anything else I need to do?"}, {"speaker": "Intake Specialist", "text": "Not at the moment. Just keep all your medical records and any correspondence related to the incident handy. It’ll be helpful for our attorney when they contact you. We work on a contingency fee basis, which means you won’t have to pay any upfront fees; we only get paid if you win your case."}, {"speaker": "Caller", "text": "Okay, that sounds fair."}, {"speaker": "Intake Specialist", "text": "Perfect! I’ll make sure to note everything we discussed today, including your injuries, the insurance information, and your experience with the other attorney. Thank you for sharing all this with me. I know it’s not easy. Is there anything else you’d like to ask or add before we wrap up?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now. Thank you for your help, Carlos."}, {"speaker": "Intake Specialist", "text": "You’re welcome! I’m here to help. Take care, and we’ll be in touch soon. Have a great day!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "bded9247-bfab-46fe-8c61-1268c67ab1ae", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I’m calling because I was involved in an incident at a hotel, and I think I might need some help."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you’ve been through something like this. I’d be happy to help you with the details. Can you tell me what happened?"}, {"speaker": "Caller", "text": "Sure. It was on July 17, 2021, at the Cedar Oaks Apartments in Denver. I was in the lobby when I accidentally spilled scalding coffee on myself. It was really hot, and I ended up getting burned."}, {"speaker": "Intake Specialist", "text": "Ouch, that sounds really painful! I'm glad you're okay now. Can you tell me about the injuries you sustained from this incident?"}, {"speaker": "Caller", "text": "Yeah, I ended up with a compound fracture of my tibia because I fell trying to get away from the coffee. It was pretty serious."}, {"speaker": "Intake Specialist", "text": "I can only imagine how difficult that must have been for you. Have you received any medical treatment for your injury?"}, {"speaker": "Caller", "text": "Yes, I had to go to the hospital, and I had surgery to fix the fracture. I've been in physical therapy since then."}, {"speaker": "Intake Specialist", "text": "That sounds like a tough road to recovery. I hope you're doing better now. Just to clarify, did you have to take time off work as a result of your injury?"}, {"speaker": "Caller", "text": "Yes, I did. I missed about three months of work."}, {"speaker": "Intake Specialist", "text": "I see, that must have impacted you financially as well. Now, regarding the incident itself, can you tell me more about how it happened? Was there anything specific that led to the spill?"}, {"speaker": "Caller", "text": "Well, I was standing in line to get coffee, and the server handed me the cup, but it was so hot that I fumbled it, and it spilled all over me."}, {"speaker": "Intake Specialist", "text": "That sounds pretty chaotic. Did you notice if there were any warning signs or anything that could have prevented the incident, like a sign indicating that the coffee was very hot?"}, {"speaker": "Caller", "text": "No, there were no signs at all. I think they should have had something to warn people."}, {"speaker": "Intake Specialist", "text": "That’s an important detail. It seems like there may have been some negligence involved. Did you happen to exchange any insurance information with the hotel or the property owner?"}, {"speaker": "Caller", "text": "Yes, I did. They mentioned that the property owner has a general liability policy, but I don’t know the exact details."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you got that information. Having liability coverage is essential in these types of situations. Now, you mentioned earlier that you were calling for help—do you currently have another attorney representing you for this incident?"}, {"speaker": "Caller", "text": "Yes, I do. I spoke to someone, but I’m not feeling very confident about how they're handling my case."}, {"speaker": "Intake Specialist", "text": "I understand how frustrating that can be, especially when you’re dealing with such serious injuries. Just to confirm, what would you like to achieve by reaching out to us today? Are you looking for a second opinion or considering switching representation?"}, {"speaker": "Caller", "text": "I think I just want to get a better understanding of my options and see if I should consider changing lawyers."}, {"speaker": "Intake Specialist", "text": "That makes complete sense. It’s important to feel confident in your legal representation. I’ll pass along all the information you’ve shared with me to one of our attorneys. They’ll review it and get back to you to discuss your options in more detail."}, {"speaker": "Caller", "text": "That sounds great. Thank you, Diana."}, {"speaker": "Intake Specialist", "text": "You’re welcome! Just to summarize, you were injured on July 17, 2021, at Cedar Oaks Apartments in Denver when you spilled scalding coffee on yourself, resulting in a compound fracture of your tibia. You’ve had medical treatment and missed work due to the injury. You exchanged insurance information and know that the property owner has general liability coverage. You also mentioned that you currently have another attorney but aren’t feeling confident in their handling of your case."}, {"speaker": "Caller", "text": "Yes, that’s all correct."}, {"speaker": "Intake Specialist", "text": "Perfect! I’ll make sure to get this information to our attorney, who will reach out to you soon. Is there anything else you’d like to ask or anything else I can assist you with right now?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I hope you have a great rest of your day, and we’ll be in touch soon. Take care!"}], "outcome_status": "trial", "outcome_value": 0}
{"id": "a1d0bf98-52e5-4509-a250-20da3415f78b", "transcript": [{"speaker": "Intake Specialist", "text": "Good morning! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Alex. I was involved in an accident at a hotel, and I’m looking for some guidance."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. I’d be happy to help you gather some information about what happened. Can you tell me a bit more about the incident?"}, {"speaker": "Caller", "text": "Sure. It happened on May 26, 2025, at the Sunrise Suites Hotel in Phoenix. I was in the lobby, and I accidentally got burned by some scalding coffee."}, {"speaker": "Intake Specialist", "text": "That sounds really painful! I hope you’re doing okay now. Can you describe how the burn happened? Were there any specific circumstances that contributed to the accident?"}, {"speaker": "Caller", "text": "Yeah, I was waiting in line to get some coffee from their machine. I think the employee didn’t handle it properly, and the cup was way too full. It spilled all over me."}, {"speaker": "Intake Specialist", "text": "That sounds frustrating. It sounds like the hotel staff may have some liability in this situation. Have you been able to exchange any insurance information with the hotel or the coffee vendor?"}, {"speaker": "Caller", "text": "I didn’t get any insurance details from them. I just assumed they would have coverage since it's a big hotel."}, {"speaker": "Intake Specialist", "text": "That makes sense. Given that Sunrise Suites is a major corporation, they likely have liability insurance. It’s good to note that. Now, can you tell me about your injuries? You mentioned a burn—how severe was it, and are there any other injuries you sustained?"}, {"speaker": "Caller", "text": "Yes, the burn was pretty bad, but I also developed whiplash and two herniated discs from the fall I took when I reacted to the spill. I’ve been in a lot of pain."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. It sounds like you’ve been through a lot. Have you sought any medical treatment for these injuries, like seeing a doctor or getting physical therapy?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the incident. They treated the burn and did some scans for my back. I’ve been doing physical therapy for the herniated discs."}, {"speaker": "Intake Specialist", "text": "That’s important. Keeping records of your medical treatment will be helpful moving forward. Have you been able to keep track of any medical expenses or bills related to your treatment?"}, {"speaker": "Caller", "text": "Yes, I have all the bills and receipts. It’s been quite expensive."}, {"speaker": "Intake Specialist", "text": "I can imagine. Keeping documentation of those expenses will be very useful for your case. Now, I want to confirm whether you’ve spoken to or hired another attorney regarding this incident?"}, {"speaker": "Caller", "text": "No, I haven’t had any other representation yet."}, {"speaker": "Intake Specialist", "text": "Great to know. So, to summarize, you were burned by scalding coffee in the lobby of the Sunrise Suites Hotel on May 26, 2025. You sustained burns and developed whiplash along with two herniated discs. You’ve received medical treatment and have documentation of your expenses, but you haven’t spoken to another attorney."}, {"speaker": "Caller", "text": "That’s right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. The next step will be for me to pass this information along to one of our attorneys who will review your case. They’ll be in touch to discuss it further and provide guidance on your options."}, {"speaker": "Caller", "text": "Okay, that sounds good. How long will it take for them to get back to me?"}, {"speaker": "Intake Specialist", "text": "Generally, our attorneys aim to reach out within 24 to 48 hours. If they need any more information, they’ll let you know during that call."}, {"speaker": "Caller", "text": "That works for me. And just to clarify, how do your fees work?"}, {"speaker": "Intake Specialist", "text": "We operate on a contingency fee basis, which means you don’t pay anything upfront. We only collect a fee if we successfully recover compensation for you. If that happens, it will be a percentage of the settlement or award."}, {"speaker": "Caller", "text": "Got it, that makes sense. Thank you for explaining that."}, {"speaker": "Intake Specialist", "text": "You’re welcome! If you have any further questions or need assistance in the meantime, feel free to reach out. We’re here to help. Is there anything else you’d like to discuss today?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help, Alex."}, {"speaker": "Intake Specialist", "text": "Absolutely, I’m glad I could assist. I’ll make sure your information gets to our attorney right away. Take care, and I hope to speak with you soon!"}, {"speaker": "Caller", "text": "Thank you! Goodbye."}, {"speaker": "Intake Specialist", "text": "Goodbye!"}], "outcome_status": "settled", "outcome_value": 60000}
{"id": "24ed42ed-5019-44b8-9b51-25dae0cf4137", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I help you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I was in a car accident a while ago, and I’m looking for some advice on what to do next."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you were in an accident. I’d be happy to help you gather some information. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure! It was on June 22, 2020, in Seattle. I was driving my delivery van when I got T-boned at an intersection downtown."}, {"speaker": "Intake Specialist", "text": "That sounds really stressful. I hope you’re doing okay now. Can you tell me more about how the accident occurred? Were there any traffic signals involved, or was it a busy intersection?"}, {"speaker": "Caller", "text": "It was a busy intersection. I had the green light, and the other delivery van just ran the red light and hit me."}, {"speaker": "Intake Specialist", "text": "That’s definitely concerning. It sounds like the other driver may be at fault if they ran the red light. Were there any witnesses to the accident, or did the police come to the scene?"}, {"speaker": "Caller", "text": "Yes, there were a couple of people who saw it happen, and the police did come. They took a report, but I haven’t gotten a copy of it yet."}, {"speaker": "Intake Specialist", "text": "That’s good to know you had witnesses and a police report. Those can be really helpful. Can you tell me about any injuries you sustained in the accident?"}, {"speaker": "Caller", "text": "I ended up with a sprained ankle and some deep contusions on my leg. It was pretty painful, and I had to take some time off work."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you’ve been in pain and had to take time off. Have you received any medical treatment for those injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the accident, and I had some follow-up appointments with my doctor."}, {"speaker": "Intake Specialist", "text": "It’s good that you sought treatment. That can really help with documenting your injuries. Now, did you exchange insurance information with the other driver?"}, {"speaker": "Caller", "text": "Yes, I did. They had a standard auto policy, but I didn’t get all the details. I just have the name of their insurance company."}, {"speaker": "Intake Specialist", "text": "That’s a good start. Having the insurance company’s name can be helpful when we look into the next steps. Have you had any communication with their insurance company yet?"}, {"speaker": "Caller", "text": "No, I haven’t contacted them since the accident. I wasn’t sure if I should."}, {"speaker": "Intake Specialist", "text": "It's understandable to feel uncertain about that. We can guide you on how to navigate that process. Since you mentioned you were in a delivery van, does your employer have any insurance coverage for accidents that occur while you’re working?"}, {"speaker": "Caller", "text": "Yes, they do have coverage, but I’m not sure how that works in this situation."}, {"speaker": "Intake Specialist", "text": "That’s okay. We can look into that further if needed. Just to clarify, do you currently have any other attorney representing you in this matter?"}, {"speaker": "Caller", "text": "No, I don’t have anyone representing me right now."}, {"speaker": "Intake Specialist", "text": "That’s helpful to know. Based on what you've shared, it seems like there are some issues regarding liability since the other driver may have run the red light. And it sounds like you have some injuries that need to be addressed as well. I’ll summarize what we’ve discussed so far: you were in a T-bone accident in Seattle on June 22, 2020, in a delivery van. You sustained a sprained ankle and deep contusions, and you have a police report and witness statements. The other driver has a standard auto policy, and you do not currently have an attorney."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Great! The next step is that I’ll pass this information along to one of our attorneys. They’ll review everything and get back to you to discuss your options. I can also help answer any questions you might have about the process or our fees while you’re waiting."}, {"speaker": "Caller", "text": "That would be helpful. What are your fees?"}, {"speaker": "Intake Specialist", "text": "We work on a contingency fee basis, which means we only get paid if you win your case or reach a settlement. If that happens, a percentage of the settlement will go to us. There are no upfront fees or costs for you."}, {"speaker": "Caller", "text": "That sounds fair. Thank you for explaining that."}, {"speaker": "Intake Specialist", "text": "Of course! I’m glad I could help. Is there anything else you’d like to know or discuss right now?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now."}, {"speaker": "Intake Specialist", "text": "Alright! I’ll make sure to pass along all the details we've talked about, and one of our attorneys will reach out to you soon. If you have any more questions in the meantime, feel free to call us back. Take care, and I hope you feel better soon!"}, {"speaker": "Caller", "text": "Thank you so much, Diana. I appreciate your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! Have a great day!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "1241eba6-2c35-4dfa-a0b9-405718b0310f", "transcript": [{"speaker": "Intake Specialist", "text": "Good afternoon! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about an incident I had at a hotel last year."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you had an incident. Can you tell me a little more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on September 4th, 2022. I was in the lobby of a hotel in Austin, Texas, and I accidentally burned myself with scalding coffee that was left unattended."}, {"speaker": "Intake Specialist", "text": "That sounds really painful. I'm glad you're safe now. Can you tell me a bit more about how the incident occurred? Was the coffee just sitting out, or was there something else going on?"}, {"speaker": "Caller", "text": "It was a coffee station set up in the lobby. I think someone filled a cup and just left it there. I didn’t see it, and when I reached for something else, I knocked it over and it spilled all over me."}, {"speaker": "Intake Specialist", "text": "I understand. So, it sounds like the coffee was not properly monitored. Did you speak to anyone at the hotel right after the incident?"}, {"speaker": "Caller", "text": "Yes, I talked to the hotel staff right away. They were apologetic and took me to get some ice, but they didn’t really do much else."}, {"speaker": "Intake Specialist", "text": "Did you happen to get any names of the staff members you spoke with, or did you fill out any incident reports?"}, {"speaker": "Caller", "text": "I didn’t get any names, but I did fill out a report. They said they would document it."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you documented the incident. Now, regarding your injuries, you mentioned you were burned. Did you seek any medical attention after the incident?"}, {"speaker": "Caller", "text": "Yes, I ended up going to the hospital because the burn was pretty serious. They also discovered that I had torn my rotator cuff when I tried to catch myself from falling."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you had to go through all that. Torn rotator cuffs can be really painful. How has your recovery been since the accident?"}, {"speaker": "Caller", "text": "It’s been rough. I’ve had to go through physical therapy, and I still struggle with pain and mobility. It’s really affected my daily life and my job."}, {"speaker": "Intake Specialist", "text": "That sounds incredibly challenging. I can see how this has had a significant impact on you. Have you already spoken to any attorneys about this case, or is this your first time reaching out for help?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to any other attorneys. This is my first call."}, {"speaker": "Intake Specialist", "text": "Great, thanks for sharing that with me. Now, regarding the hotel, do you happen to know if they have insurance, or did they provide you with any information about coverage?"}, {"speaker": "Caller", "text": "Yeah, I believe they’re a part of a major corporation. I didn’t get the insurance information directly, but I assume they have good coverage."}, {"speaker": "Intake Specialist", "text": "That makes sense since it’s a larger corporation. Did you exchange any information about the incident with them, like an insurance company name?"}, {"speaker": "Caller", "text": "No, I didn’t get any insurance details from them directly."}, {"speaker": "Intake Specialist", "text": "That’s okay. It’s common for people to not get that information on the spot. I can help you in gathering that if we proceed. Now, can I ask how you’ve been managing any medical expenses related to your injuries?"}, {"speaker": "Caller", "text": "I’ve been using my health insurance, but there have been quite a few out-of-pocket costs, especially for physical therapy."}, {"speaker": "Intake Specialist", "text": "I understand how that can add up. We often see that with personal injury cases. Just to clarify, are you currently still undergoing treatment or therapy?"}, {"speaker": "Caller", "text": "Yes, I’m still going to therapy a couple of times a week."}, {"speaker": "Intake Specialist", "text": "Thank you for the details. It sounds like this has been an ongoing process for you. Now, since this is a premises liability case, I want to make sure we have a clear understanding of who might be liable. Based on what you’ve told me, it seems that the hotel could be responsible for not properly managing the coffee station. Would you agree?"}, {"speaker": "Caller", "text": "Yes, I think they should take responsibility for it. It was their job to keep that area safe."}, {"speaker": "Intake Specialist", "text": "That’s a solid perspective. The hotel has a duty to ensure the safety of its guests. Before we move forward, is there anything else you feel is important for me to know about the incident or your injuries?"}, {"speaker": "Caller", "text": "I think that covers most of it, but I’m really concerned about how this will affect my future, especially with my job."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. It's important to consider the long-term effects of your injuries. I’ll make sure the attorney who reviews your case takes your concerns into account."}, {"speaker": "Caller", "text": "Thank you, Carlos. I appreciate that."}, {"speaker": "Intake Specialist", "text": "Of course! Just to summarize what we’ve discussed: You had an incident on September 4th, 2022, at a hotel in Austin, Texas, where you were burned by scalding coffee, which resulted in a torn rotator cuff. You’ve been seeking treatment and are still undergoing physical therapy. You believe the hotel, a major corporation, may have good insurance coverage, but you didn’t exchange any insurance details with them. You’re also not currently represented by another attorney."}, {"speaker": "Caller", "text": "That’s right."}, {"speaker": "Intake Specialist", "text": "Perfect. I’ll pass this information along to one of our attorneys who will review it and get back to you as soon as possible. They’ll reach out to discuss your options and any next steps. Do you have any questions for me before we wrap up?"}, {"speaker": "Caller", "text": "No, I think that’s it. Thank you for your help."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! Thank you for sharing your story with me. We’ll be in touch soon, and I hope you have a good rest of your day."}, {"speaker": "Caller", "text": "Thanks, Carlos. You too!"}], "outcome_status": "settled", "outcome_value": 90000}
{"id": "89cdf640-f7cf-4d67-8871-67e1d0874bb6", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda, I’m calling about a dog bite incident that happened last year."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you went through that. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on February 11, 2022. I was delivering a package to a client, and their German Shepherd suddenly bit me."}, {"speaker": "Intake Specialist", "text": "That sounds really frightening. I hope you’re doing okay now. Can you tell me how the bite happened? Were you interacting with the dog, or did it happen unexpectedly?"}, {"speaker": "Caller", "text": "It was unexpected. I was just approaching the door when the dog came out and bit my leg. I didn’t see it coming at all."}, {"speaker": "Intake Specialist", "text": "That must have been quite alarming. Did you notice if the dog had any history of aggressive behavior, or was this the first time it happened?"}, {"speaker": "Caller", "text": "I didn’t know the dog before this incident, but I’ve since heard from neighbors that it had bitten someone else before."}, {"speaker": "Intake Specialist", "text": "That adds an important context to the situation. Did you manage to get the owner’s contact information or any insurance details after the bite?"}, {"speaker": "Caller", "text": "Yes, I got their name and phone number, but they are renters. I’m not sure what kind of insurance they have."}, {"speaker": "Intake Specialist", "text": "It's good that you were able to get their contact information. Since they are renters, they might have renter's insurance that could cover the incident. Did you have a chance to exchange any insurance information with them?"}, {"speaker": "Caller", "text": "No, they didn’t provide any insurance details at the time. I just took their phone number and left."}, {"speaker": "Intake Specialist", "text": "I see. Have you had any medical treatment for the injuries from the bite?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the incident. They said I had a mild traumatic brain injury, which was really scary."}, {"speaker": "Intake Specialist", "text": "That sounds serious. I’m glad you sought medical attention. Have you experienced any ongoing symptoms or issues since the injury?"}, {"speaker": "Caller", "text": "Yes, I’ve had some headaches and difficulty concentrating, and it’s been really frustrating."}, {"speaker": "Intake Specialist", "text": "I can only imagine how challenging that must be. Have you been able to see any specialists or get follow-up care for your brain injury?"}, {"speaker": "Caller", "text": "I started seeing a neurologist a few months ago, but it took a while to get an appointment."}, {"speaker": "Intake Specialist", "text": "It’s understandable that there can be delays in getting treatment. Have you kept records of your medical visits and any treatments or medications prescribed?"}, {"speaker": "Caller", "text": "Yes, I’ve been keeping all the documents related to my medical treatment."}, {"speaker": "Intake Specialist", "text": "That’s great to hear. Keeping thorough records will be very helpful. Have you had any time off work due to your injuries?"}, {"speaker": "Caller", "text": "Yes, I missed about two weeks of work while I was recovering."}, {"speaker": "Intake Specialist", "text": "I'm sorry to hear that. It must have been a difficult time for you. Have you discussed the situation with your employer regarding any compensation for lost wages?"}, {"speaker": "Caller", "text": "I mentioned it to HR, but I haven’t pursued it further."}, {"speaker": "Intake Specialist", "text": "That's understandable. It can be overwhelming to deal with everything at once. Have you already spoken to any other attorneys about this case?"}, {"speaker": "Caller", "text": "No, you’re the first firm I’m contacting."}, {"speaker": "Intake Specialist", "text": "Thank you for considering us. Based on what you’ve shared, we generally see clear liability in dog bite cases, especially with the history of the dog. It’s also good that you have documentation of your injuries and medical treatment."}, {"speaker": "Caller", "text": "That makes sense."}, {"speaker": "Intake Specialist", "text": "Just to clarify the next steps, I’ll be passing this information along to one of our attorneys. They’ll review everything and get back to you soon. Also, I want to mention that we work on a contingency fee basis, meaning you won’t have to pay any upfront fees; we only take a fee if you receive compensation."}, {"speaker": "Caller", "text": "That sounds good. Thank you for explaining that."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! Before we wrap up, is there anything else you’d like to ask or any other details about the incident you think I should know?"}, {"speaker": "Caller", "text": "No, I think I covered everything. I just really hope something can be done about it."}, {"speaker": "Intake Specialist", "text": "I understand, and we'll do our best to help you. Thank you for sharing your experience with me today. I’ll make sure to get this information to our attorney, and they’ll be in touch with you shortly."}, {"speaker": "Caller", "text": "Thank you, Brenda. I appreciate your help."}, {"speaker": "Intake Specialist", "text": "You’re welcome! Take care, and we’ll be in contact soon. Have a great day!"}], "outcome_status": "settled", "outcome_value": 80000}
{"id": "d9758113-81ce-463e-b1a0-32b504a83faa", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda. I was in a motorcycle accident a while back, and I'm trying to figure out my options."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you were in an accident. That can be really tough. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on December 13, 2022, and I was riding my motorcycle on I-95 when a pickup truck rear-ended me."}, {"speaker": "Intake Specialist", "text": "That sounds really serious. I hope you’re doing okay now. Can you describe how the accident happened? Were you stopped or moving when you were hit?"}, {"speaker": "Caller", "text": "I was moving, but I wasn't going fast. The truck just slammed into me from behind. I didn’t see it coming at all."}, {"speaker": "Intake Specialist", "text": "That must have been quite shocking. Did the driver of the truck stop and exchange information with you?"}, {"speaker": "Caller", "text": "Yes, he did. We exchanged our insurance information, but I haven’t confirmed any coverage yet."}, {"speaker": "Intake Specialist", "text": "I see. That’s an important step. Do you remember the name of the insurance company for the pickup truck?"}, {"speaker": "Caller", "text": "Yes, it was XYZ Insurance."}, {"speaker": "Intake Specialist", "text": "Great, that’s helpful. Now, can you tell me about any injuries you sustained in the accident?"}, {"speaker": "Caller", "text": "I ended up with a torn rotator cuff. It’s been really painful and has affected my ability to work and do everyday activities."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. A torn rotator cuff can be quite debilitating. Have you received any medical treatment for this injury?"}, {"speaker": "Caller", "text": "Yes, I’ve had physical therapy and doctor visits. I might need surgery, but I’m still discussing options with my doctor."}, {"speaker": "Intake Specialist", "text": "That sounds like a lot to handle. Have you kept records of your medical treatments, like bills or doctor’s notes?"}, {"speaker": "Caller", "text": "Yes, I have all my medical records and bills. I’ve been pretty organized about it."}, {"speaker": "Intake Specialist", "text": "That’s excellent to hear. Having that documentation will be very helpful. Just to clarify, have you spoken to or hired another attorney regarding this case?"}, {"speaker": "Caller", "text": "No, I haven’t. I wanted to understand my options better before deciding on legal representation."}, {"speaker": "Intake Specialist", "text": "That makes sense. We’re here to help you with that. Given the details you've shared, it seems there’s clear liability on the part of the other driver, especially since you were rear-ended."}, {"speaker": "Caller", "text": "Yes, it feels that way to me too."}, {"speaker": "Intake Specialist", "text": "And since you have significant injuries and documentation of your medical treatments, you may have a solid case for compensation. Do you have any concerns or questions about the process so far?"}, {"speaker": "Caller", "text": "I’m just a bit worried about the costs. I don’t want to end up with a huge bill if I decide to go forward."}, {"speaker": "Intake Specialist", "text": "I understand that concern. We work on a contingency fee basis, which means you won’t pay any upfront fees. We only get paid if we win your case, so there's less risk for you."}, {"speaker": "Caller", "text": "That makes me feel better."}, {"speaker": "Intake Specialist", "text": "I’m glad to hear that! So, to summarize, you were involved in a rear-end motorcycle accident on I-95 on December 13, 2022. You suffered a torn rotator cuff, have received medical treatment, and have documentation ready. You exchanged information with the other driver, whose insurance is with XYZ Insurance. You haven’t consulted with another attorney yet."}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. The next step would be for me to pass this information on to one of our attorneys. They will review the details and get back to you to discuss your case further. Is there a good number for them to reach you, or would you prefer an email?"}, {"speaker": "Caller", "text": "You can reach me at my phone number."}, {"speaker": "Intake Specialist", "text": "Perfect! I’ll make sure they have that information. Is there anything else you’d like to ask or discuss before we wrap up?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you today. Someone from our team will be in touch soon. Take care, and I hope you feel better soon!"}, {"speaker": "Caller", "text": "Thanks, Brenda. Bye!"}, {"speaker": "Intake Specialist", "text": "Bye!"}], "outcome_status": "settled", "outcome_value": 90000}
{"id": "bb272909-d80e-4c44-8555-8d77b6e36fba", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about a dog bite incident I was involved in."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. Dog bites can be really serious. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It happened on March 31st at a public park in Phoenix. I was just walking when a mixed-breed dog that was off-leash came up and bit me."}, {"speaker": "Intake Specialist", "text": "That sounds really distressing. Were you able to get the owner's information after the incident?"}, {"speaker": "Caller", "text": "Yes, I did. I got their name and they mentioned they have homeowner's insurance."}, {"speaker": "Intake Specialist", "text": "That's good to know. It’s important to have that information. Can you describe the circumstances a bit more? For example, were there any other witnesses around, and do you know if the dog has a history of aggressive behavior?"}, {"speaker": "Caller", "text": "There were a few people nearby who saw the whole thing happen, and I didn’t hear anything about the dog being aggressive before this. The owner seemed surprised that their dog had bitten me."}, {"speaker": "Intake Specialist", "text": "Thank you for that detail. It sounds like there were no prior incidents reported. Now, can you tell me more about your injuries? You mentioned a sprained ankle and deep contusions?"}, {"speaker": "Caller", "text": "Yes, after the bite, I fell and twisted my ankle, and I also got some deep bruises on my arm from the dog’s bite."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that you're dealing with these injuries. Have you received any medical treatment for them?"}, {"speaker": "Caller", "text": "Yes, I went to the emergency room right after the bite. They treated my ankle and gave me some medication for the pain."}, {"speaker": "Intake Specialist", "text": "That’s important to note. Medical documentation can be really helpful. Are you currently experiencing any ongoing pain or other symptoms related to the injuries?"}, {"speaker": "Caller", "text": "Yes, my ankle still hurts a lot, and I’m having trouble walking normally."}, {"speaker": "Intake Specialist", "text": "I can understand how frustrating that must be for you. It’s good to have that noted. So, to recap: you were bitten by an off-leash mixed-breed dog at a public park on March 31st, you received medical treatment for a sprained ankle and deep contusions, and the dog owner has homeowner's insurance. Is that correct?"}, {"speaker": "Caller", "text": "Yes, that's all correct."}, {"speaker": "Intake Specialist", "text": "Great! Now, have you spoken to any other attorneys about this case, or are you currently represented by anyone?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to anyone else yet."}, {"speaker": "Intake Specialist", "text": "Thank you for clarifying that. It’s important for us to know. Now, regarding the homeowner's insurance, did you exchange any insurance information with the dog owner?"}, {"speaker": "Caller", "text": "Yes, I got the name of their insurance company, but I didn’t get any policy numbers or anything like that."}, {"speaker": "Intake Specialist", "text": "That’s absolutely fine. Having the name of the insurance company is a good start. It helps us understand how to move forward. Is there anything else you’d like to share about the incident or your injuries that we haven’t covered yet?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now."}, {"speaker": "Intake Specialist", "text": "Perfect! Thank you for sharing all of this information with me. I’ll pass this along to one of our attorneys who will review it and get back to you soon. They will reach out to discuss the details and next steps. Do you have any questions for me in the meantime?"}, {"speaker": "Caller", "text": "No, I think I’m good. Thank you for your help, Carlos."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you today. Remember, we’re here to help you through this process. Take care, and you’ll be hearing from us shortly!"}, {"speaker": "Caller", "text": "Thanks, Carlos. Talk to you soon."}, {"speaker": "Intake Specialist", "text": "Talk to you soon!"}], "outcome_status": "trial", "outcome_value": 0}
{"id": "b43247a7-9362-459a-811a-22155f12f9bd", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Alex. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Alex. I need to talk about an accident I had with a pressure cooker."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. I can definitely help you with that. Can you give me a bit more detail about what happened?"}, {"speaker": "Caller", "text": "Sure. It happened on September 17th, 2023, in my kitchen. The pressure cooker just exploded while I was using it."}, {"speaker": "Intake Specialist", "text": "That sounds really scary! I hope you’re doing okay now. Can you tell me more about how the explosion occurred? Were there any specific circumstances that led up to it?"}, {"speaker": "Caller", "text": "I was following the instructions exactly. I had it on the stove, and it just... blew up. There was a loud bang, and I got hurt trying to shield myself from the debris."}, {"speaker": "Intake Specialist", "text": "That must have been terrifying. I’m glad you’re here to talk about it. You mentioned you got hurt—what kind of injuries did you sustain?"}, {"speaker": "Caller", "text": "I broke my wrist, and I’ve been dealing with some lingering nerve pain since then. It’s been really tough to manage."}, {"speaker": "Intake Specialist", "text": "I can only imagine how difficult that must be for you. Have you received any medical treatment for your injuries?"}, {"speaker": "Caller", "text": "Yes, I had to go to the hospital right after it happened. They put my wrist in a cast, and I’ve been doing physical therapy for the nerve pain."}, {"speaker": "Intake Specialist", "text": "It sounds like you've been through a lot. Have you been able to get any information about the pressure cooker? For example, do you know the brand or model?"}, {"speaker": "Caller", "text": "Yes, it was a VoltRide X2. I remember because it's not a brand I had heard of before."}, {"speaker": "Intake Specialist", "text": "Thank you for that detail. Since it's a product defect case, it will be important to look into whether the manufacturer has any liability. Did you happen to find out if the pressure cooker came with any warranty or if there was any recall information available?"}, {"speaker": "Caller", "text": "I checked after the accident, and it looks like this company is pretty small and based overseas. I don’t think there’s much information out there about them."}, {"speaker": "Intake Specialist", "text": "That makes sense. It can be challenging when dealing with smaller companies. Did you manage to gather any information about their insurance or warranty coverage?"}, {"speaker": "Caller", "text": "No, I didn't get any insurance info. I didn’t think about that at the time."}, {"speaker": "Intake Specialist", "text": "That’s okay! Sometimes, it’s hard to think about those details during an accident. Since you mentioned it was a small overseas company, it might be a bit tricky to find out about their insurance coverage. Have you spoken with anyone else about this incident or sought legal representation?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to anyone else or hired an attorney yet."}, {"speaker": "Intake Specialist", "text": "Got it. It’s good that you reached out to us. We can help you from here. Now, let’s talk a little more about your injuries. Have you been able to work since the accident?"}, {"speaker": "Caller", "text": "I've had to take time off. It’s hard to do my job with a broken wrist and the pain."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. That can definitely add stress on top of everything else. Are there any other damages, like property damage or lost wages, that you think may come into play here?"}, {"speaker": "Caller", "text": "Well, the pressure cooker is obviously useless now, and I'll have to get a new one. I haven’t calculated lost wages yet, but I’m worried about that."}, {"speaker": "Intake Specialist", "text": "That’s understandable. It sounds like there are multiple factors to consider. Just to recap, you were injured on September 17th when the VoltRide X2 pressure cooker exploded, resulting in a broken wrist and nerve pain. You haven’t spoken to another attorney or gathered insurance information from the manufacturer yet."}, {"speaker": "Caller", "text": "Yes, that all sounds right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. The next step is for me to pass this information along to one of our attorneys who specializes in product defect cases. They will review everything and get back to you with some options. We work on a contingency fee basis, so you won't have to pay anything upfront."}, {"speaker": "Caller", "text": "That sounds good. How long will it take to hear back?"}, {"speaker": "Intake Specialist", "text": "Typically, you can expect to hear from one of our attorneys within a few business days. They’ll reach out to discuss your case in more detail and go over any questions you might have. Is there anything else I can help you with today?"}, {"speaker": "Caller", "text": "No, I think that’s everything for now. Thank you for your help, Alex."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you. Take care of yourself, and we’ll be in touch soon. Have a great day!"}], "outcome_status": "settled", "outcome_value": 60000}
{"id": "ad4b473a-1709-43fb-b637-fb05b2c721a4", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about an accident I had a while back."}, {"speaker": "Intake Specialist", "text": "I'm sorry to hear that you experienced an accident. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on August 4, 2021. I was at a grocery store in Denver, and I slipped on a freshly mopped floor."}, {"speaker": "Intake Specialist", "text": "That sounds really unfortunate. Slipping on a wet floor can lead to some serious injuries. Were you injured in the fall?"}, {"speaker": "Caller", "text": "Yes, I sprained my ankle pretty badly, and I also had some deep contusions."}, {"speaker": "Intake Specialist", "text": "Ouch! That sounds painful. How has your recovery been since the incident?"}, {"speaker": "Caller", "text": "It was a slow process. I had to take some time off work, and I still have some lingering discomfort."}, {"speaker": "Intake Specialist", "text": "I can imagine that must have been frustrating for you. It’s important to take care of yourself. Now, can you tell me if you reported the incident to anyone at the grocery store?"}, {"speaker": "Caller", "text": "Yes, I reported it right away. They had a manager come over and fill out an incident report."}, {"speaker": "Intake Specialist", "text": "That’s great that you reported it. Did you happen to get any information from the store regarding their insurance?"}, {"speaker": "Caller", "text": "They mentioned that the property owner has a general liability policy, but I didn’t get any specific details about it."}, {"speaker": "Intake Specialist", "text": "That’s understandable. It sounds like there's a possibility of coverage if they have a general liability policy. Did you exchange insurance information with the store or the property owner?"}, {"speaker": "Caller", "text": "No, I didn’t get any insurance info. They were focused on the report, and I was more concerned about my ankle at the time."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. Your health is the priority. Have you sought any medical treatment for your injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the doctor right after the accident and had some physical therapy afterward."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that. It’s important to have documentation of your injuries. Now, have you spoken to any other attorneys regarding this incident?"}, {"speaker": "Caller", "text": "No, I haven’t. I’m reaching out to you first."}, {"speaker": "Intake Specialist", "text": "I appreciate you considering us! It sounds like there’s a clear liability here since you slipped on a freshly mopped floor, and it seems there may be some coverage options available despite not having the details. Have you incurred any medical expenses or lost wages due to your injuries?"}, {"speaker": "Caller", "text": "Yes, I had to pay for the doctor visits and therapy. I also lost a couple of weeks of pay while I was recovering."}, {"speaker": "Intake Specialist", "text": "That’s definitely significant. Medical expenses and lost wages can add up quickly. Have you kept all your medical records and bills related to the treatment?"}, {"speaker": "Caller", "text": "Yes, I have been keeping everything organized."}, {"speaker": "Intake Specialist", "text": "That’s excellent! Having that documentation will be very helpful. Can I ask if you’ve experienced any other damages, like pain and suffering or emotional distress?"}, {"speaker": "Caller", "text": "I’ve definitely felt some frustration and stress from not being able to work, but I haven’t pursued anything outside of the medical expenses."}, {"speaker": "Intake Specialist", "text": "That’s understandable. Physical injuries can lead to emotional impacts as well. With everything you’ve shared, it sounds like you have a solid basis for a potential claim. The next step would be for me to pass this information along to one of our attorneys who can review the details and discuss your options further."}, {"speaker": "Caller", "text": "Okay, that sounds good. What’s the next step after that?"}, {"speaker": "Intake Specialist", "text": "Once I pass this information to our attorney, they will reach out to you to discuss your case in more detail and answer any questions you might have. Just to clarify, we work on a contingency fee basis, meaning you won’t owe us anything unless we successfully recover compensation for you."}, {"speaker": "Caller", "text": "That sounds fair. Thank you for explaining that."}, {"speaker": "Intake Specialist", "text": "Of course! To summarize, you slipped on a freshly mopped floor at a grocery store in Denver on August 4, 2021, injuring your ankle and suffering contusions. You reported the incident and have medical documentation of your treatment, but you don’t have specific insurance details. You’ve not spoken to any other attorneys, and you’ve kept track of your expenses related to this incident."}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Great! I’ll make sure to pass all of this information to one of our attorneys, and they will get back to you soon. Is there a preferred way for them to contact you?"}, {"speaker": "Caller", "text": "You can reach me by phone."}, {"speaker": "Intake Specialist", "text": "Perfect. We’ll make sure to do that. If you think of any other questions in the meantime, feel free to call us back. Thank you for reaching out, and take care of yourself!"}, {"speaker": "Caller", "text": "Thank you, Carlos. I appreciate your help!"}, {"speaker": "Intake Specialist", "text": "You’re welcome! Have a great day!"}], "outcome_status": "settled", "outcome_value": 90000}
{"id": "797e27dd-2374-4a6e-b83f-364bd9833053", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I’m calling about an accident I had a while ago, and I’m looking for some help."}, {"speaker": "Intake Specialist", "text": "Absolutely, I’m here to listen. Can you tell me a little more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on June 17, 2021. I was walking outside an office building in Seattle, and I tripped over an uneven sidewalk slab."}, {"speaker": "Intake Specialist", "text": "Oh no, that sounds painful! I’m sorry to hear that. Were you injured in the fall?"}, {"speaker": "Caller", "text": "Yes, I ended up with whiplash and two herniated discs in my back."}, {"speaker": "Intake Specialist", "text": "That sounds really serious. I can imagine how that’s affected your daily life. Have you been able to receive any medical treatment for those injuries?"}, {"speaker": "Caller", "text": "Yes, I went to a doctor and have been undergoing physical therapy since then."}, {"speaker": "Intake Specialist", "text": "That’s good to hear you’re getting treatment. Have you had any issues with your recovery, or do you feel like you’re making progress?"}, {"speaker": "Caller", "text": "It’s been a slow process. I still have pain, and the physical therapy helps, but it’s definitely not easy."}, {"speaker": "Intake Specialist", "text": "I can understand that. Dealing with persistent pain can be really challenging. Now, can I ask how you ended up tripping over the sidewalk slab? Was there any warning, like signage, indicating that the sidewalk was uneven?"}, {"speaker": "Caller", "text": "No, there were no signs or anything. It was just really hard to see, and I didn’t expect it to be so uneven."}, {"speaker": "Intake Specialist", "text": "That makes sense. It sounds like there could be some liability involved here. Did you happen to find out who owns the property where the incident occurred?"}, {"speaker": "Caller", "text": "Yes, I believe it’s owned by the City of Springfield Public Works."}, {"speaker": "Intake Specialist", "text": "Great, that’s helpful information. Did you exchange any insurance information with the city or the property owner at the time of the accident?"}, {"speaker": "Caller", "text": "I didn’t get any insurance information. I really didn’t think about it at the time."}, {"speaker": "Intake Specialist", "text": "That’s understandable, especially after experiencing an accident. Have you looked into whether the city has any liability insurance for incidents like this?"}, {"speaker": "Caller", "text": "I’m not sure. I didn’t think about that either."}, {"speaker": "Intake Specialist", "text": "No problem at all. It sometimes can be a bit overwhelming right after an incident. Now, I see that you mentioned you already have another attorney. Can you tell me a bit about that? What’s your current attorney doing for you?"}, {"speaker": "Caller", "text": "I just consulted with them initially. They helped me with some paperwork but haven’t really moved forward on anything since then."}, {"speaker": "Intake Specialist", "text": "I appreciate you sharing that with me. It’s important to know what steps have already been taken. Have you discussed the details of your case with them, including the injuries and the accident itself?"}, {"speaker": "Caller", "text": "Yes, I explained everything. But I feel like they haven’t been very proactive lately."}, {"speaker": "Intake Specialist", "text": "That can be frustrating, especially when you’re dealing with ongoing pain and recovery. It’s essential to have someone who is actively working on your case. Can I ask if you feel comfortable continuing with your current attorney, or are you considering making a change?"}, {"speaker": "Caller", "text": "I’m not entirely sure. I’d like to see what options I have."}, {"speaker": "Intake Specialist", "text": "I completely understand. It’s important to feel confident in your representation. Now, let’s circle back to your injuries. You mentioned whiplash and the herniated discs. Have you experienced any other damages, like lost wages or other medical costs?"}, {"speaker": "Caller", "text": "Yes, I’ve missed quite a bit of work because of my condition, and the medical bills are piling up."}, {"speaker": "Intake Specialist", "text": "That’s definitely concerning. Missing work can put a significant strain on you financially, especially with medical bills. Have you kept records of your medical expenses and your work absences?"}, {"speaker": "Caller", "text": "Yes, I have all my medical records and pay stubs showing the time I missed."}, {"speaker": "Intake Specialist", "text": "That’s excellent to hear. Keeping those records will be very helpful. Just to clarify, how did you hear about our firm?"}, {"speaker": "Caller", "text": "I found you online while searching for personal injury lawyers."}, {"speaker": "Intake Specialist", "text": "I’m glad you reached out to us! I want to summarize what we've discussed so far. You tripped over an uneven sidewalk slab outside an office building in Seattle on June 17, 2021, and suffered whiplash and two herniated discs. The property is owned by the City of Springfield Public Works, and you didn’t exchange any insurance information at the time of the accident. You’ve been receiving medical treatment and physical therapy, but it’s been a slow recovery. You also have another attorney who has been somewhat inactive in your case."}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming that. What I’ll do is pass this information along to one of our attorneys for a review, and they'll be in touch with you to discuss your situation further. We work on a contingency fee basis, meaning we only get paid if you do, so there’s no upfront cost for you."}, {"speaker": "Caller", "text": "That sounds good. Thank you, Carlos."}, {"speaker": "Intake Specialist", "text": "You’re welcome! If you have any more questions or need any assistance in the meantime, feel free to reach out. We’re here to help. I hope you have a great day, and take care!"}, {"speaker": "Caller", "text": "Thanks, you too!"}], "outcome_status": "settled", "outcome_value": 70000}
{"id": "86edb85d-fb70-43fe-81d2-61963502e3e4", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda. I’m calling about a dog bite incident that happened last year."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you went through such an experience. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on January 9, 2022, in Austin, Texas. I was delivering a package, and the dog, a German Shepherd, came out and bit me."}, {"speaker": "Intake Specialist", "text": "That sounds really distressing. I can only imagine how frightening that must have been. Can you share more details about the circumstances of the incident? For example, were you on the property when the dog attacked?"}, {"speaker": "Caller", "text": "Yes, I was on the property, at the front door, trying to deliver the package."}, {"speaker": "Intake Specialist", "text": "Thank you for clarifying that. Did you happen to exchange any insurance information with the dog's owner?"}, {"speaker": "Caller", "text": "Yes, the owner mentioned they had homeowner's insurance."}, {"speaker": "Intake Specialist", "text": "That’s good to know. It can be helpful in cases like this. Were there any witnesses to the incident who might have seen what happened?"}, {"speaker": "Caller", "text": "Yes, there was a neighbor who saw the whole thing. They even came over to help after I got bitten."}, {"speaker": "Intake Specialist", "text": "That’s helpful! Having a witness can strengthen your case. Now, can you tell me about your injuries? You mentioned you were bitten—how did that affect you?"}, {"speaker": "Caller", "text": "I ended up breaking my wrist during the incident, and even now, I'm dealing with some lingering nerve pain that makes it hard to do certain things."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that you’re still experiencing pain. That must be incredibly frustrating. Did you seek medical attention for your injuries?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after it happened. They treated my wrist and prescribed pain medication, but the nerve pain has continued."}, {"speaker": "Intake Specialist", "text": "It’s important that you got medical care. It sounds like this has had a significant impact on your daily life. Have you kept any records of your medical visits or treatments?"}, {"speaker": "Caller", "text": "Yes, I have all the medical records and bills from the hospital."}, {"speaker": "Intake Specialist", "text": "Great! Those documents will be useful. Now, have you spoken with any other attorneys regarding this incident?"}, {"speaker": "Caller", "text": "No, I haven’t talked to anyone else yet."}, {"speaker": "Intake Specialist", "text": "I appreciate your honesty. It’s important to get the right support. Now, based on what you've shared, I want to summarize: you were bitten by a German Shepherd while delivering a package on January 9, 2022, and you have sustained a broken wrist and ongoing nerve pain. You also have the owner’s homeowner’s insurance information and a witness to the incident, which is helpful."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Thank you for confirming! The next steps would be for me to pass this information to one of our attorneys, who will review the details of your case. They will get back to you with their insights and advice on how to proceed. Does that sound good to you?"}, {"speaker": "Caller", "text": "Yes, that sounds good. How long will it take for someone to contact me?"}, {"speaker": "Intake Specialist", "text": "Typically, our attorneys will reach out within a few days, but it can vary depending on their current workload. If you have any urgent questions in the meantime, feel free to call us back."}, {"speaker": "Caller", "text": "Okay, I appreciate that."}, {"speaker": "Intake Specialist", "text": "Of course! Before we wrap up, do you have any additional questions or concerns that we haven't covered?"}, {"speaker": "Caller", "text": "No, I think that’s everything for now. Thank you for your help, Brenda."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you. I’ll make sure your information gets to our attorney. Take care, and we’ll be in touch soon!"}, {"speaker": "Caller", "text": "Thank you! Bye."}, {"speaker": "Intake Specialist", "text": "Bye!"}], "outcome_status": "dropped", "outcome_value": 0}
{"id": "bc8ac7fb-74dd-41e6-a7e8-98f30786fb2b", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Diana. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Diana. I was in a motorcycle accident a few weeks ago, and I’m looking for some guidance on what to do next."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear about your accident. That must have been a really tough experience for you. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on September 2nd, in downtown Arizona. I was riding my motorcycle, and I got T-boned by a ride-share SUV at an intersection."}, {"speaker": "Intake Specialist", "text": "That sounds really serious. T-bone accidents can be quite dangerous. Were you injured in the accident?"}, {"speaker": "Caller", "text": "Yes, I suffered a compound fracture of my tibia. It’s been really painful, and I’m worried about how long it’s going to take to heal."}, {"speaker": "Intake Specialist", "text": "I can imagine how painful that must be. It’s important to take care of yourself. Have you received any medical treatment for your injury?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the accident, and I’ve had follow-up appointments since then."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you’re getting the care you need. Now, regarding the accident itself, do you know if the other driver has insurance?"}, {"speaker": "Caller", "text": "Yes, they do. I found out they have a standard auto insurance policy."}, {"speaker": "Intake Specialist", "text": "Great, that’s helpful information. Did you manage to exchange insurance details with the other driver?"}, {"speaker": "Caller", "text": "Yes, we exchanged information at the scene. I have their insurance company’s name."}, {"speaker": "Intake Specialist", "text": "Perfect. That will be important for any claims you might pursue. Now, I know you mentioned you were injured, but have there been any other damages, like damage to your motorcycle or any other property?"}, {"speaker": "Caller", "text": "Honestly, there wasn’t much property damage to the motorcycle. Just some scratches. I was more focused on my injury."}, {"speaker": "Intake Specialist", "text": "I understand. Your health is definitely the priority. You mentioned that you’re looking for guidance. Do you currently have another attorney representing you for this case?"}, {"speaker": "Caller", "text": "Yes, I spoke with another law firm, but I’m not sure if I want to continue with them."}, {"speaker": "Intake Specialist", "text": "That’s completely understandable. It’s important to feel comfortable with your representation. What concerns do you have about your current attorney?"}, {"speaker": "Caller", "text": "I feel like I haven’t been getting enough communication from them. I want someone who will keep me updated."}, {"speaker": "Intake Specialist", "text": "Communication is key in these situations, and it’s understandable to want that reassurance. Let’s go back to the accident for a moment. Do you know if there were any witnesses to the incident?"}, {"speaker": "Caller", "text": "Yes, there were a couple of people who saw it happen. They even came over to check on me afterward."}, {"speaker": "Intake Specialist", "text": "That’s good to know. Witnesses can really help in clarifying what happened. Did you get their contact information?"}, {"speaker": "Caller", "text": "I didn’t get their numbers, but I know they were around."}, {"speaker": "Intake Specialist", "text": "That’s understandable. We can always try to track them down later if needed. Do you recall if there were any police involved? Did they file a report?"}, {"speaker": "Caller", "text": "Yes, the police came and filed a report at the scene. I think they noted that the other driver was at fault."}, {"speaker": "Intake Specialist", "text": "That’s very important and strengthens your case. It sounds like you have some solid evidence. Now, regarding your injury, have you incurred any medical expenses so far?"}, {"speaker": "Caller", "text": "Yes, I’ve had hospital bills and ongoing therapy costs. It’s adding up quickly."}, {"speaker": "Intake Specialist", "text": "I can imagine. Medical expenses can be overwhelming. Just to clarify, have you received any compensation or insurance payouts for your injuries yet?"}, {"speaker": "Caller", "text": "No, not yet. I haven’t pursued anything since I was still figuring out what to do."}, {"speaker": "Intake Specialist", "text": "That's understandable, especially with everything going on. Just so you know, our firm works on a contingency fee basis, which means you won’t owe us anything unless we secure compensation for you."}, {"speaker": "Caller", "text": "That sounds good. I like that idea."}, {"speaker": "Intake Specialist", "text": "I’m glad to hear that! So, to summarize, you were in a motorcycle accident on September 2nd, where you were T-boned by a ride-share SUV. You have a compound fracture of your tibia, and you received medical treatment but haven’t yet pursued compensation. You have the other driver’s insurance information, and there’s already a police report indicating fault. You also expressed some concerns about your current attorney’s communication."}, {"speaker": "Caller", "text": "Yes, that’s right."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing all of that with me. I’ll pass this information along to one of our attorneys who will review it and get back to you soon. Is there anything else you’d like to ask or discuss in the meantime?"}, {"speaker": "Caller", "text": "No, I think that covers everything for now. Thank you for your help."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I appreciate you taking the time to speak with me today. We’ll be in touch soon, and I hope you get better quickly. Take care!"}], "outcome_status": "settled", "outcome_value": 15000}
{"id": "f765514c-0d2f-482c-87c6-802a4d3a1a66", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Carlos. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi, Carlos. I was in an accident at a grocery store, and I need some help figuring out what to do next."}, {"speaker": "Intake Specialist", "text": "I'm sorry to hear that you were in an accident. I’d be happy to help you through this process. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on July 10th, and I was shopping at MegaSave Supermarket in Atlanta. I slipped on a freshly mopped floor and fell."}, {"speaker": "Intake Specialist", "text": "That sounds really painful. I hope you’re doing okay now. Did you seek any medical attention after the fall?"}, {"speaker": "Caller", "text": "Yes, I did. I ended up with whiplash and two herniated discs. It’s been pretty rough."}, {"speaker": "Intake Specialist", "text": "I can imagine. Those are serious injuries. Have you received ongoing treatment for them?"}, {"speaker": "Caller", "text": "Yes, I've been seeing a chiropractor and doing physical therapy."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you’re getting treatment. Going back to the incident, do you recall if there were any warning signs or cones indicating that the floor was wet?"}, {"speaker": "Caller", "text": "Not that I saw. I think they were just mopping, and I didn’t notice until it was too late."}, {"speaker": "Intake Specialist", "text": "It’s unfortunate that there weren’t any warnings. Was there anyone else with you at the time, or did anyone witness the fall?"}, {"speaker": "Caller", "text": "There were other shoppers around, but I don’t know if anyone saw it happen."}, {"speaker": "Intake Specialist", "text": "I understand. Sometimes it can be tricky to find witnesses. Did you happen to exchange any information with the store or get their insurance details?"}, {"speaker": "Caller", "text": "I didn’t get any insurance info, but I did let the manager know about the fall. They didn’t mention their insurance."}, {"speaker": "Intake Specialist", "text": "That’s helpful to know. Since it was at a grocery store, they might have liability insurance, but we can look into that later. Did you take any pictures of the scene or get any documentation from the store?"}, {"speaker": "Caller", "text": "I didn’t take pictures, but I did fill out an incident report with the store manager."}, {"speaker": "Intake Specialist", "text": "Great, that incident report can be very useful. Now, have you spoken to any other attorneys about this incident?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to anyone else."}, {"speaker": "Intake Specialist", "text": "Alright, that gives us a good starting point. Just to clarify, you mentioned your injuries—are there any other damages you’ve experienced, like lost wages or other medical expenses?"}, {"speaker": "Caller", "text": "Yes, I’ve had to miss work for my therapy appointments, and my medical bills are piling up."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. It sounds like this incident is affecting many aspects of your life. Have you kept records of your medical expenses and lost wages?"}, {"speaker": "Caller", "text": "Yes, I have all my medical bills and documentation from my employer about my time off."}, {"speaker": "Intake Specialist", "text": "Perfect, that documentation will be crucial if we move forward. Now, since you mentioned that the store is MegaSave Supermarket, do you know if they have a specific management company or if they’re part of a larger chain?"}, {"speaker": "Caller", "text": "I think they’re part of a larger chain, but I’m not sure about the management details."}, {"speaker": "Intake Specialist", "text": "No problem, we can investigate that. Since you’re dealing with significant injuries, it’s vital we gather all the necessary information to build your case. Do you have any concerns or questions about how the process works?"}, {"speaker": "Caller", "text": "I’m just worried about how long this might take and if I have to pay anything upfront."}, {"speaker": "Intake Specialist", "text": "That’s a common concern. I can assure you that we work on a contingency fee basis, which means you won’t have to pay anything upfront. We only get paid if we win your case. As for the timeline, it can vary depending on several factors, but we’ll keep you informed every step of the way."}, {"speaker": "Caller", "text": "That sounds good. I appreciate that."}, {"speaker": "Intake Specialist", "text": "Of course! To summarize, you slipped on a freshly mopped floor at MegaSave Supermarket on July 10th, resulting in whiplash and two herniated discs. You filled out an incident report but didn’t get any insurance details. You have medical documentation and records of lost wages, and you haven’t spoken to any other attorneys. \n\nI’ll pass this information along to one of our attorneys who will review it and get back to you with the next steps. Is there anything else you would like to ask or anything I might have missed?"}, {"speaker": "Caller", "text": "No, I think that covers everything. Thank you for your help, Carlos."}, {"speaker": "Intake Specialist", "text": "You’re very welcome! Thank you for calling, and we’ll be in touch soon. Take care!"}], "outcome_status": "trial", "outcome_value": 0}
{"id": "8a5335d8-daf1-44cf-bd41-7ff4f237ce87", "transcript": [{"speaker": "Intake Specialist", "text": "Hi there! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda, I was in a car accident last week, and I’m not sure what to do next."}, {"speaker": "Intake Specialist", "text": "I'm sorry to hear that you were in an accident. That can be really stressful. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure, it was on November 4th in downtown Denver. I was driving my pickup truck, and another pickup truck ran a red light and T-boned me."}, {"speaker": "Intake Specialist", "text": "That sounds really scary! It’s good to hear you’re okay enough to call. How would you describe the damage to your vehicle?"}, {"speaker": "Caller", "text": "My truck has some pretty significant damage on the side where they hit me. I think it’s going to need a lot of repairs."}, {"speaker": "Intake Specialist", "text": "I see. And how about you? Were you injured in the accident?"}, {"speaker": "Caller", "text": "Yes, I sustained some lacerations. I had to get 30 stitches on my arm."}, {"speaker": "Intake Specialist", "text": "Ouch, that sounds painful! I hope you’re getting the care you need. Have you been able to follow up with a doctor since the accident?"}, {"speaker": "Caller", "text": "I went to the ER right after the accident, but I haven't seen a doctor since then."}, {"speaker": "Intake Specialist", "text": "It’s important to keep up with your medical treatment, especially with the injuries you’ve described. Are you experiencing any ongoing pain or issues since the lacerations?"}, {"speaker": "Caller", "text": "Yeah, it’s been pretty uncomfortable, especially when I try to use my arm too much."}, {"speaker": "Intake Specialist", "text": "That’s understandable. It's crucial to document your injuries and any pain you’re experiencing. Now, can I ask about the other driver? Did you exchange insurance information at the scene?"}, {"speaker": "Caller", "text": "Yes, I did. They mentioned they had a standard auto insurance policy."}, {"speaker": "Intake Specialist", "text": "Good to hear you got that information. Do you happen to know the name of their insurance company?"}, {"speaker": "Caller", "text": "I think they said it was State Farm."}, {"speaker": "Intake Specialist", "text": "Great, that’s helpful. Since they were at fault, their insurance should cover your damages. Have you been in contact with them or filed a claim yet?"}, {"speaker": "Caller", "text": "No, I haven't done anything with their insurance yet. I’m not sure how to start that process."}, {"speaker": "Intake Specialist", "text": "That’s perfectly okay! I can help guide you through that. Just to clarify, do you have any other representation or have you spoken to another attorney about this accident?"}, {"speaker": "Caller", "text": "No, I haven't talked to anyone else yet."}, {"speaker": "Intake Specialist", "text": "Alright, that’s good to know. It sounds like you have a solid case with clear liability, especially since the other driver ran a red light. Now, aside from your physical injuries, have you experienced any other damages, like lost wages or property damage?"}, {"speaker": "Caller", "text": "Well, I haven’t been able to work since the accident, so I guess I’ve lost some income too. And my truck is going to cost a lot to fix."}, {"speaker": "Intake Specialist", "text": "I’m sorry to hear that. Lost wages can definitely add more stress to an already tough situation. Do you have any estimates on the repair costs for your truck?"}, {"speaker": "Caller", "text": "Not yet. I haven’t taken it to a shop for an estimate, but I know it won’t be cheap."}, {"speaker": "Intake Specialist", "text": "That makes sense. It’s a good idea to get an estimate as soon as you can, as it will help with your claims process. Have you kept any documentation, like medical records or photos of the accident?"}, {"speaker": "Caller", "text": "I took some photos of the damage and my injuries right after the accident, and I have the medical paperwork from the ER visit."}, {"speaker": "Intake Specialist", "text": "Excellent! Keeping a record of everything will be very beneficial for your case. It’s important to have all the necessary documentation when dealing with insurance. Since you mentioned you haven't contacted their insurance yet, I recommend doing that soon."}, {"speaker": "Caller", "text": "Yeah, I guess I should get on that."}, {"speaker": "Intake Specialist", "text": "Absolutely. I can also help you with that process when you’re ready. Just to summarize what we’ve discussed: you were in a T-bone accident on November 4th in Denver, you sustained significant injuries requiring 30 stitches, and the other driver has a standard auto policy with State Farm. You haven’t spoken to another attorney, and you need to gather more documentation and possibly get an estimate for your truck repairs."}, {"speaker": "Caller", "text": "Yes, that sounds right."}, {"speaker": "Intake Specialist", "text": "Perfect! I’ll pass this information along to one of our attorneys, who will review your case and get back to you soon. They’ll be able to provide guidance on how to proceed, especially regarding your insurance claim and any potential compensation for your damages."}, {"speaker": "Caller", "text": "Thank you, Brenda. I appreciate your help!"}, {"speaker": "Intake Specialist", "text": "You’re very welcome! I’m glad I could assist you today. If you have any other questions in the meantime, feel free to reach out. Take care and we’ll be in touch soon!"}], "outcome_status": "settled", "outcome_value": 90000}
{"id": "01eed3ed-f7bc-42d8-9446-a8afb5a832db", "transcript": [{"speaker": "Intake Specialist", "text": "Hello! Thank you for calling Morgan & Associates. My name is Brenda. How can I assist you today?"}, {"speaker": "Caller", "text": "Hi Brenda. I was in an accident recently, and I’m looking for some help."}, {"speaker": "Intake Specialist", "text": "I’m really sorry to hear that. I’d be happy to help you gather some information about your situation. Can you tell me a bit more about what happened?"}, {"speaker": "Caller", "text": "Sure. It was on June 4th in Seattle. I was riding my motorcycle when a rideshare driver sideswiped me."}, {"speaker": "Intake Specialist", "text": "That sounds really frightening! I'm glad you're reaching out. Can you describe how the accident happened? Were there any other vehicles involved, and what was the traffic like?"}, {"speaker": "Caller", "text": "Well, I was in a lane, and the rideshare driver was in the next lane over. They didn’t signal and just moved over right into me. There was a pickup truck behind me, but I don’t think they were involved in the accident."}, {"speaker": "Intake Specialist", "text": "Thank you for sharing that with me. It sounds like the rideshare driver may be at fault here if they didn’t signal and changed lanes without checking. Have you had a chance to exchange insurance information with the other driver?"}, {"speaker": "Caller", "text": "I tried to, but they didn’t have their insurance details on them. They said they would send it later, but I haven’t received anything yet."}, {"speaker": "Intake Specialist", "text": "I see. That can be frustrating. It’s important to have that information. Did you happen to catch the name of the rideshare company or any details about their insurance?"}, {"speaker": "Caller", "text": "Yes, it was Uber. I think they might have the insurance through them."}, {"speaker": "Intake Specialist", "text": "That’s good to know. Uber typically has insurance coverage for their drivers, but it sounds like we need to confirm that. Now, I want to make sure I understand the injuries you sustained. Can you tell me more about what happened to you?"}, {"speaker": "Caller", "text": "I ended up with a torn rotator cuff. It’s been pretty painful, and I’ve had trouble moving my arm."}, {"speaker": "Intake Specialist", "text": "That sounds very painful. I’m sorry to hear you’re going through that. Have you sought any medical treatment for your injury?"}, {"speaker": "Caller", "text": "Yes, I went to the hospital right after the accident, and they did some scans. I’m currently seeing a physical therapist as well."}, {"speaker": "Intake Specialist", "text": "That’s good to hear that you’re getting treatment. Physical therapy can be really beneficial for recovery. Have you been able to miss work because of your injury?"}, {"speaker": "Caller", "text": "Yeah, I’ve had to take some time off. It’s hard to work when I can’t lift my arm."}, {"speaker": "Intake Specialist", "text": "I understand. Taking time off work adds to the stress of the situation. Have you kept any records or documentation regarding your medical treatment and missed work?"}, {"speaker": "Caller", "text": "Yes, I’ve kept all the medical bills and records from my physical therapy sessions. I also have a note from my doctor about my time off work."}, {"speaker": "Intake Specialist", "text": "That’s great. Keeping detailed records will definitely help in your case. Now, have you spoken to any other attorneys about this incident, or are you currently working with anyone?"}, {"speaker": "Caller", "text": "No, I haven’t spoken to anyone else. You’re the first person I’m reaching out to."}, {"speaker": "Intake Specialist", "text": "Thank you for trusting us with your situation. It sounds like you’ve been through a lot. Just to clarify, how do you feel about the liability in this case? Do you believe the rideshare driver is clearly at fault?"}, {"speaker": "Caller", "text": "Yes, I think they are. They didn’t signal, and I was in my lane."}, {"speaker": "Intake Specialist", "text": "That makes sense. We’ll be sure to highlight that aspect when we review your case. As for insurance coverage, it sounds like we need to confirm the rideshare driver's insurance details, especially since you haven’t received anything yet. Is there anything else you think I should know about the accident or your injuries?"}, {"speaker": "Caller", "text": "Not really. I just want to make sure I can cover my medical bills and get back to normal."}, {"speaker": "Intake Specialist", "text": "Absolutely, and that’s a very reasonable goal. We work on a contingency fee basis, which means you won’t have to pay anything upfront. We only get paid if we win your case."}, {"speaker": "Caller", "text": "That sounds good. What happens next?"}, {"speaker": "Intake Specialist", "text": "I’ll compile all the information you’ve shared with me and pass it along to one of our attorneys who will review your case. They will get back to you shortly to discuss the next steps. Do you have a preferred way for them to contact you?"}, {"speaker": "Caller", "text": "Email would be best for me."}, {"speaker": "Intake Specialist", "text": "Perfect! Can I get your email address, please?"}, {"speaker": "Caller", "text": "Sure, it’s johnsmith@email.com."}, {"speaker": "Intake Specialist", "text": "Thank you, John. I’ll make sure our attorney has that information. Just to summarize, you were in a motorcycle accident on June 4th in Seattle, where a rideshare driver sideswiped you. You sustained a torn rotator cuff, are receiving treatment, and have documentation ready. You haven’t spoken to any other attorneys yet, and you’re looking for help to cover your medical bills."}, {"speaker": "Caller", "text": "Yes, that’s correct."}, {"speaker": "Intake Specialist", "text": "Great! I’ll get this information to our attorney, and they’ll reach out to you soon. If you think of any other questions or details, feel free to call us back. Thank you for reaching out to Morgan & Associates, and take care!"}, {"speaker": "Caller", "text": "Thank you, Brenda. I appreciate your help."}, {"speaker": "Intake Specialist", "text": "You’re welcome, John! Have a good day!"}], "outcome_status": "dropped", "outcome_value": 0}
